{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "_": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "}": 91,
      "←": 92,
      "↑": 93,
      "↖": 94,
      "16": 95,
      "((": 96,
      "))": 97,
      "c2": 98,
      "nj": 99,
      "c4": 100,
      "in": 101,
      "-(": 102,
      "nk": 103,
      "15": 104,
      "c3": 105,
      "-((": 106,
      "-((-(": 107,
      "c1": 108,
      "nl": 109,
      "nm": 110,
      "le": 111,
      "or": 112,
      "for": 113,
      "?((": 114,
      "pr": 115,
      "ma": 116,
      "++": 117,
      "mp": 118,
      "int": 119,
      "++)": 120,
      "omp": 121,
      "][": 122,
      "<=": 123,
      "ni": 124,
      "ou": 125,
      ")))": 126,
      "ag": 127,
      "prag": 128,
      "pragma": 129,
      "ble": 130,
      "dou": 131,
      "ar": 132,
      "double": 133,
      "));": 134,
      "?-((-(": 135,
      "(((": 136,
      ");": 137,
      "de": 138,
      "si": 139,
      "st": 140,
      "re": 141,
      "al": 142,
      "sim": 143,
      "lu": 144,
      "--": 145,
      "simd": 146,
      "00": 147,
      "clu": 148,
      "clude": 149,
      "include": 150,
      "ti": 151,
      "if": 152,
      "lo": 153,
      "))))": 154,
      "se": 155,
      "12": 156,
      "(-": 157,
      "?-(": 158,
      "?(-": 159,
      "?-(-": 160,
      "te": 161,
      "loc": 162,
      "((((": 163,
      "len": 164,
      "par": 165,
      "lel": 166,
      "allel": 167,
      "parallel": 168,
      "std": 169,
      "um": 170,
      "en": 171,
      "arg": 172,
      "print": 173,
      "on": 174,
      "rn": 175,
      "ta": 176,
      "printf": 177,
      "ch": 178,
      "tu": 179,
      "))?((": 180,
      "retu": 181,
      "return": 182,
      "----": 183,
      "main": 184,
      "(\"": 185,
      "];": 186,
      "\",": 187,
      "lock": 188,
      "er": 189,
      "//": 190,
      "io": 191,
      "stdio": 192,
      "ze": 193,
      "128": 194,
      "th": 195,
      "))?(((": 196,
      "()": 197,
      "sk": 198,
      "500": 199,
      ">=": 200,
      "ri": 201,
      "omp_": 202,
      "var": 203,
      "==": 204,
      "=%": 205,
      "c0": 206,
      "task": 207,
      "size": 208,
      "sum": 209,
      "*/": 210,
      "/*": 211,
      "19": 212,
      "ate": 213,
      "100": 214,
      "tion": 215,
      "oi": 216,
      "&&": 217,
      "])": 218,
      "of": 219,
      "(&": 220,
      "t_": 221,
      "ed": 222,
      "iv": 223,
      ")))))": 224,
      "priv": 225,
      "private": 226,
      "voi": 227,
      "void": 228,
      "ad": 229,
      "argc": 230,
      "argv": 231,
      "ra": 232,
      "]);": 233,
      "--------": 234,
      "(((((": 235,
      "c8": 236,
      "num": 237,
      "],": 238,
      "ib": 239,
      "it": 240,
      "ol": 241,
      "tid": 242,
      "ps": 243,
      "]=": 244,
      "ste": 245,
      "t_lock": 246,
      "steps": 247,
      "read": 248,
      "sh": 249,
      "ing": 250,
      "end": 251,
      "13": 252,
      "ction": 253,
      "))));": 254,
      "c5": 255,
      "el": 256,
      "yb": 257,
      "99": 258,
      "tsteps": 259,
      "char": 260,
      "out": 261,
      "ck": 262,
      "ench": 263,
      "set_lock": 264,
      "as": 265,
      "def": 266,
      "un": 267,
      "ata": 268,
      "ce": 269,
      "pol": 270,
      "dep": 271,
      "ybench": 272,
      "polybench": 273,
      "*)": 274,
      "c15": 275,
      "lib": 276,
      "ser": 277,
      "stdlib": 278,
      "depend": 279,
      "tic": 280,
      "the": 281,
      "sert": 282,
      "ared": 283,
      "thread": 284,
      "[])": 285,
      "shared": 286,
      "10": 287,
      "nd": 288,
      "ro": 289,
      "sizeof": 290,
      "assert": 291,
      "();": 292,
      "ray": 293,
      ")))));": 294,
      "+=": 295,
      "ait": 296,
      "data": 297,
      "wait": 298,
      "))))?((": 299,
      "arri": 300,
      "(){": 301,
      "20": 302,
      "]=%": 303,
      "fre": 304,
      "ine": 305,
      "++){": 306,
      "arrier": 307,
      "free": 308,
      "block": 309,
      "et": 310,
      "num_": 311,
      "ul": 312,
      "array": 313,
      "at": 314,
      "c9": 315,
      "++;": 316,
      "32": 317,
      "ini": 318,
      "29": 319,
      "65": 320,
      "am": 321,
      "ng": 322,
      "co": 323,
      "is": 324,
      "sing": 325,
      "section": 326,
      "lloc": 327,
      "long": 328,
      "define": 329,
      "barrier": 330,
      "1000": 331,
      "(\"%": 332,
      "ase": 333,
      "c7": 334,
      "pa": 335,
      "c10": 336,
      "malloc": 337,
      "tim": 338,
      "taskwait": 339,
      "----------------": 340,
      "polybench_": 341,
      "50": 342,
      "di": 343,
      "18": 344,
      "xa": 345,
      "ent": 346,
      "fo": 347,
      "))?(((((": 348,
      "omp_un": 349,
      "49": 350,
      "con": 351,
      "il": 352,
      "der": 353,
      "sta": 354,
      "else": 355,
      "48": 356,
      "55": 357,
      "cou": 358,
      "es": 359,
      "to": 360,
      "pro": 361,
      "alloc": 362,
      "ult": 363,
      "foo": 364,
      "coun": 365,
      "\");": 366,
      "[-": 367,
      "du": 368,
      "omp_set_lock": 369,
      "single": 370,
      "omp_unset_lock": 371,
      "base": 372,
      "lck": 373,
      "ror": 374,
      "tmp": 375,
      "200": 376,
      "->": 377,
      "63": 378,
      "l0": 379,
      "l1": 380,
      "tial": 381,
      "ter": 382,
      "static": 383,
      "(*": 384,
      "25": 385,
      "ation": 386,
      "cri": 387,
      "ic": 388,
      "map": 389,
      "(((((((": 390,
      "tical": 391,
      "rom": 392,
      "critical": 393,
      "57": 394,
      "89": 395,
      "((((((": 396,
      "timer": 397,
      "Th": 398,
      "pu": 399,
      "?((((": 400,
      ")));": 401,
      "team": 402,
      "teams": 403,
      "_lock": 404,
      "be": 405,
      "bu": 406,
      "][-": 407,
      "str": 408,
      "one": 409,
      "sum1": 410,
      "put": 411,
      "ct": 412,
      "dx": 413,
      "targ": 414,
      "max": 415,
      "threads": 416,
      "tiali": 417,
      "target": 418,
      "60": 419,
      "ca": 420,
      "cor": 421,
      "fprintf": 422,
      "ir": 423,
      "ke": 424,
      "u1": 425,
      "val": 426,
      "stri": 427,
      "127": 428,
      "error": 429,
      "atoi": 430,
      "barrier_": 431,
      "bute": 432,
      ",(": 433,
      "61": 434,
      "_size": 435,
      "_block": 436,
      "ile": 437,
      "ice": 438,
      "inde": 439,
      "inout": 440,
      "stder": 441,
      "190": 442,
      "130": 443,
      "num_threads": 444,
      "counter": 445,
      "_block_size": 446,
      "index": 447,
      "stderr": 448,
      "(*)": 449,
      ")[": 450,
      "21": 451,
      "27": 452,
      "_data": 453,
      "ne": 454,
      "pe": 455,
      "wh": 456,
      ")),(": 457,
      "rnel": 458,
      "])(": 459,
      "ckag": 460,
      "packag": 461,
      "polybench_alloc": 462,
      "kernel": 463,
      "(*)[": 464,
      "polybench_alloc_data": 465,
      "_t": 466,
      "tof": 467,
      "res": 468,
      "temp": 469,
      "tofrom": 470,
      "(-(": 471,
      "?(-(": 472,
      "and": 473,
      "ault": 474,
      "cal": 475,
      "ge": 476,
      "dest": 477,
      "?-(-(": 478,
      "sum0": 479,
      "roy": 480,
      "destroy": 481,
      "33": 482,
      "]+": 483,
      "ment": 484,
      "vice": 485,
      "device": 486,
      "distri": 487,
      "tialize": 488,
      "distribute": 489,
      "**": 490,
      "67": 491,
      "69": 492,
      "94": 493,
      "dy": 494,
      "om": 495,
      "op": 496,
      "164": 497,
      "init": 498,
      "159": 499,
      "120": 500,
      "ched": 501,
      "198": 502,
      "blocks": 503,
      "187": 504,
      "xa1": 505,
      "xa2": 506,
      "!=": 507,
      ",\"": 508,
      "31": 509,
      "by": 510,
      "use": 511,
      "xx": 512,
      "yy": 513,
      "omp_ge": 514,
      "omp_get_": 515,
      "71": 516,
      "IZ": 517,
      "MS": 518,
      "[%": 519,
      "c6": 520,
      "done": 521,
      "ff": 522,
      "fib": 523,
      "l2": 524,
      "u2": 525,
      "ve": 526,
      "mat": 527,
      "art": 528,
      "lush": 529,
      "))))))": 530,
      ")))))))": 531,
      "omp_ini": 532,
      "omp_destroy": 533,
      "--------------------------------": 534,
      "polybench_timer": 535,
      "packages": 536,
      "IZE": 537,
      "MSIZE": 538,
      "polybench_timer_": 539,
      "no": 540,
      "ph": 541,
      "lement": 542,
      "race": 543,
      "thread_": 544,
      "sections": 545,
      "pair": 546,
      "ild": 547,
      "Thread": 548,
      "while": 549,
      "(+": 550,
      "){": 551,
      "11": 552,
      "1st": 553,
      "23": 554,
      "2nd": 555,
      "bp": 556,
      "f1": 557,
      "idx": 558,
      "min": 559,
      "sched": 560,
      "dout": 561,
      "stdout": 562,
      "redu": 563,
      "unction": 564,
      "498": 565,
      "core": 566,
      "fflush": 567,
      "omp_init_lock": 568,
      "omp_destroy_lock": 569,
      "(+:": 570,
      "reduction": 571,
      "35": 572,
      "37": 573,
      "39": 574,
      "59": 575,
      "64": 576,
      "]+=": 577,
      "la": 578,
      "154": 579,
      "//#": 580,
      "197": 581,
      "default": 582,
      "cop": 583,
      "14": 584,
      "521": 585,
      "No": 586,
      "Set": 587,
      "Score": 588,
      "able": 589,
      "input": 590,
      "--;": 591,
      "output": 592,
      "atom": 593,
      "indexSet": 594,
      "result": 595,
      "omp_get_thread_": 596,
      "match": 597,
      "atomic": 598,
      "omp_get_thread_num": 599,
      ")/": 600,
      "499": 601,
      "In": 602,
      "Len": 603,
      "an": 604,
      "ea": 605,
      "function": 606,
      "ty": 607,
      "))))?": 608,
      "child": 609,
      "1285": 610,
      "999": 611,
      "type": 612,
      "..": 613,
      "51": 614,
      "Ini": 615,
      "]!=": 616,
      "_array": 617,
      "ber": 618,
      "hea": 619,
      "i2": 620,
      "liv": 621,
      "mm": 622,
      "scop": 623,
      "ule": 624,
      "ust": 625,
      "st_lock": 626,
      "print_array": 627,
      "t_array": 628,
      "init_array": 629,
      "code": 630,
      "stru": 631,
      "cap": 632,
      "new": 633,
      "nest_lock": 634,
      "kernel_": 635,
      "call": 636,
      ",\"\\": 637,
      "polybench_timer_st": 638,
      "schedule": 639,
      "Include": 640,
      "header": 641,
      "live": 642,
      "83": 643,
      "LE": 644,
      "]*": 645,
      "ef": 646,
      "element": 647,
      "iable": 648,
      "nam": 649,
      "uni": 650,
      "vs": 651,
      "wi": 652,
      "inc": 653,
      "math": 654,
      "set": 655,
      "rand": 656,
      "2013": 657,
      "consum": 658,
      "produ": 659,
      "count": 660,
      "pec": 661,
      "Initialize": 662,
      "struct": 663,
      "unistd": 664,
      "17": 665,
      "2l": 666,
      "53": 667,
      "73": 668,
      "81": 669,
      "87": 670,
      "Data": 671,
      "comp": 672,
      "cul": 673,
      "fe": 674,
      "fl": 675,
      "myb": 676,
      "npro": 677,
      "r_": 678,
      "};": 679,
      "orde": 680,
      "ag_t": 681,
      "des": 682,
      "red": 683,
      "rect": 684,
      "lock_t": 685,
      "omp_lock_t": 686,
      "numNo": 687,
      "old": 688,
      "threadprivate": 689,
      "initialize": 690,
      "diag": 691,
      "string": 692,
      "barrier_wait": 693,
      "newS": 694,
      "incr_": 695,
      "2lf": 696,
      "flag_t": 697,
      "mybarrier": 698,
      "nprod": 699,
      "ordered": 700,
      "numNodes": 701,
      "St": 702,
      "].": 703,
      "au": 704,
      "ex": 705,
      "eck": 706,
      "gn": 707,
      "gen": 708,
      "nce": 709,
      "tp": 710,
      "tri": 711,
      "uta": 712,
      "uold": 713,
      "x_block_size": 714,
      "y_block_size": 715,
      "inLen": 716,
      "sign": 717,
      "check": 718,
      "rite": 719,
      "sum2": 720,
      "]=((": 721,
      "correct": 722,
      "irst": 723,
      "dynam": 724,
      "Threads": 725,
      "computa": 726,
      "dynamic": 727,
      "computation": 728,
      "';": 729,
      ")*": 730,
      "Be": 731,
      "Done": 732,
      "Def": 733,
      "Er": 734,
      "End": 735,
      "MY": 736,
      "Pre": 737,
      "aco": 738,
      "bi": 739,
      "f0": 740,
      "flo": 741,
      "from": 742,
      "file": 743,
      "im": 744,
      "jaco": 745,
      "ll": 746,
      "nsteps": 747,
      "nthread": 748,
      "nes": 749,
      "os": 750,
      "sj": 751,
      "so": 752,
      "wil": 753,
      "real": 754,
      "rence": 755,
      "low": 756,
      "loop": 757,
      "set_": 758,
      "ted": 759,
      "local": 760,
      "ument": 761,
      "argument": 762,
      "ates": 763,
      "numThreads": 764,
      "))))?((((": 765,
      "construct": 766,
      "20000": 767,
      "barrier_st": 768,
      "phase": 769,
      "matchScore": 770,
      "LEN": 771,
      "aux": 772,
      "correctnes": 773,
      "Error": 774,
      "MYLEN": 775,
      "float": 776,
      "jacobi": 777,
      "will": 778,
      "correctness": 779,
      ").": 780,
      ".\\": 781,
      "54": 782,
      "Var": 783,
      "ai": 784,
      "cl": 785,
      "ced": 786,
      "first": 787,
      "gth": 788,
      "mis": 789,
      "nE": 790,
      "po": 791,
      "zation": 792,
      "z_block_size": 793,
      "][(-": 794,
      "arit": 795,
      "refe": 796,
      "length": 797,
      "onal": 798,
      "vars": 799,
      "number": 800,
      "995": 801,
      "num_vars": 802,
      "ilarit": 803,
      "max_": 804,
      "can": 805,
      "valu": 806,
      "used": 807,
      "not": 808,
      "pha": 809,
      "typedef": 810,
      "with": 811,
      "Start": 812,
      "real8": 813,
      "Variable": 814,
      "reference": 815,
      "ilarity": 816,
      "\"\"": 817,
      "(!": 818,
      "2d": 819,
      "3mm": 820,
      "42": 821,
      "525": 822,
      "533": 823,
      "911": 824,
      "Ar": 825,
      "All": 826,
      "CE": 827,
      "Can": 828,
      "Di": 829,
      "DCE": 830,
      "LL": 831,
      "Ma": 832,
      "Must": 833,
      "NU": 834,
      "Pro": 835,
      "Pos": 836,
      "Run": 837,
      "Ret": 838,
      "Sto": 839,
      "_set": 840,
      "_count": 841,
      "bench": 842,
      "cle": 843,
      "cmp": 844,
      "ding": 845,
      "eve": 846,
      "ga": 847,
      "imp": 848,
      "ise": 849,
      "imin": 850,
      "m_": 851,
      "mo": 852,
      "must": 853,
      "ncon": 854,
      "ole": 855,
      "pi": 856,
      "pcounter": 857,
      "rk": 858,
      "spec": 859,
      "smatchScore": 860,
      "scan": 861,
      "using": 862,
      "vent": 863,
      "inclu": 864,
      "may": 865,
      "mark": 866,
      "blem": 867,
      "aration": 868,
      "dead": 869,
      "decl": 870,
      "sid": 871,
      "resid": 872,
      "also": 873,
      "alpha": 874,
      "similarity": 875,
      "tire": 876,
      "ific": 877,
      "entire": 878,
      "printed": 879,
      "(\"\\": 880,
      "rix": 881,
      "rieve": 882,
      "/*--------------------------------": 883,
      "10000": 884,
      "adi": 885,
      "raise": 886,
      "],\"\"": 887,
      "endscop": 888,
      "elimin": 889,
      "unsign": 890,
      "2025": 891,
      "num_teams": 892,
      "num_blocks": 893,
      "initiali": 894,
      "comm": 895,
      "section_count": 896,
      "time": 897,
      "timed": 898,
      "problem": 899,
      "allocation": 900,
      "The": 901,
      "This": 902,
      "strcmp": 903,
      "maxPos": 904,
      "cause": 905,
      "whole": 906,
      "package": 907,
      ",\"%": 908,
      "------------------------------------": 909,
      "polybench_timer_print": 910,
      "polybench_timer_stop": 911,
      "polybench_timer_start": 912,
      "diagonal": 913,
      "incr_b": 914,
      "numNodes2": 915,
      "computational": 916,
      "Default": 917,
      "Prevent": 918,
      "lower": 919,
      "set_nest_lock": 920,
      "firstprivate": 921,
      "max_num_blocks": 922,
      "Array": 923,
      "Main": 924,
      "NULL": 925,
      "Retrieve": 926,
      "Stop": 927,
      "benchmark": 928,
      "clean": 929,
      "imper": 930,
      "ncons": 931,
      "specific": 932,
      "including": 933,
      "declaration": 934,
      "/*--------------------------------------------------------------------": 935,
      "],\"\"))": 936,
      "elimination": 937,
      "unsigned": 938,
      "initialization": 939,
      "common": 940,
      "119": 941,
      "1197": 942,
      "599": 943,
      "529": 944,
      "549": 945,
      "583": 946,
      "581": 947,
      "629": 948,
      "625": 949,
      "661": 950,
      "627": 951,
      "75": 952,
      "85": 953,
      "865": 954,
      "863": 955,
      "889": 956,
      "861": 957,
      "867": 958,
      "869": 959,
      "859": 960,
      "887": 961,
      "885": 962,
      "915": 963,
      "919": 964,
      "913": 965,
      "965": 966,
      "963": 967,
      "989": 968,
      "921": 969,
      "967": 970,
      "969": 971,
      "971": 972,
      "937": 973,
      "939": 974,
      "917": 975,
      "973": 976,
      "::": 977,
      "AN": 978,
      "AX": 979,
      "Cal": 980,
      "Con": 981,
      "D_": 982,
      "Mis": 983,
      "MAX": 984,
      "Num": 985,
      "ON": 986,
      "Ra": 987,
      "Re": 988,
      "RAN": 989,
      "Si": 990,
      "Uni": 991,
      "ac": 992,
      "ft": 993,
      "gra": 994,
      "ha": 995,
      "i1": 996,
      "jb": 997,
      "kb": 998,
      "pd": 999,
      "psum": 1000,
      "pfile": 1001,
      "ver": 1002,
      "write": 1003,
      "1615": 1004,
      "1619": 1005,
      "1613": 1006,
      "1665": 1007,
      "1649": 1008,
      "1621": 1009,
      "1667": 1010,
      "1669": 1011,
      "1671": 1012,
      "1623": 1013,
      "1639": 1014,
      "1617": 1015,
      "1673": 1016,
      "1675": 1017,
      "1565": 1018,
      "1563": 1019,
      "1589": 1020,
      "1561": 1021,
      "1567": 1022,
      "1569": 1023,
      "1571": 1024,
      "1535": 1025,
      "1537": 1026,
      "1539": 1027,
      "1587": 1028,
      "left": 1029,
      "pred": 1030,
      "mast": 1031,
      "inter": 1032,
      "restri": 1033,
      "remo": 1034,
      "seg": 1035,
      "1229": 1036,
      "1249": 1037,
      "1255": 1038,
      "1225": 1039,
      "1257": 1040,
      "1227": 1041,
      "1233": 1042,
      "1231": 1043,
      "1223": 1044,
      "1259": 1045,
      "1251": 1046,
      "1253": 1047,
      "erate": 1048,
      "1281": 1049,
      "1283": 1050,
      "1929": 1051,
      "1955": 1052,
      "1925": 1053,
      "1957": 1054,
      "1961": 1055,
      "1927": 1056,
      "1933": 1057,
      "1931": 1058,
      "1935": 1059,
      "1959": 1060,
      "1951": 1061,
      "1953": 1062,
      "1329": 1063,
      "1327": 1064,
      "1333": 1065,
      "1331": 1066,
      "1311": 1067,
      "1335": 1068,
      "1337": 1069,
      "991": 1070,
      "993": 1071,
      "997": 1072,
      "2011": 1073,
      "651": 1074,
      "653": 1075,
      "655": 1076,
      "657": 1077,
      "659": 1078,
      "180": 1079,
      "1899": 1080,
      "1883": 1081,
      "1881": 1082,
      "contri": 1083,
      "551": 1084,
      "553": 1085,
      "555": 1086,
      "557": 1087,
      "progra": 1088,
      "based": 1089,
      "2003": 1090,
      "2005": 1091,
      "2007": 1092,
      "2009": 1093,
      "631": 1094,
      "633": 1095,
      "635": 1096,
      "573": 1097,
      "575": 1098,
      "577": 1099,
      "579": 1100,
      "891": 1101,
      "893": 1102,
      "895": 1103,
      "601": 1104,
      "603": 1105,
      "605": 1106,
      "607": 1107,
      "609": 1108,
      "1275": 1109,
      "1277": 1110,
      "1279": 1111,
      "buted": 1112,
      "1901": 1113,
      "1903": 1114,
      "1905": 1115,
      "1907": 1116,
      "1909": 1117,
      "1301": 1118,
      "1303": 1119,
      "1305": 1120,
      "1307": 1121,
      "1309": 1122,
      "calc": 1123,
      "calcul": 1124,
      "941": 1125,
      "943": 1126,
      "945": 1127,
      "947": 1128,
      "ome": 1129,
      "1641": 1130,
      "1643": 1131,
      "1645": 1132,
      "1647": 1133,
      "1591": 1134,
      "1593": 1135,
      "1595": 1136,
      "1597": 1137,
      "1201": 1138,
      "1203": 1139,
      "1205": 1140,
      "1207": 1141,
      "1981": 1142,
      "1983": 1143,
      "1985": 1144,
      "1987": 1145,
      "1873": 1146,
      "1875": 1147,
      "1877": 1148,
      "1879": 1149,
      "races": 1150,
      "1541": 1151,
      "1543": 1152,
      "1545": 1153,
      "1977": 1154,
      "1979": 1155,
      "consumed": 1156,
      "produced": 1157,
      "pected": 1158,
      "newSxx": 1159,
      "newSyy": 1160,
      "generate": 1161,
      "547": 1162,
      "Diag": 1163,
      "1199": 1164,
      "Calcul": 1165,
      "D_MAX": 1166,
      "Number": 1167,
      "Race": 1168,
      "RAND_MAX": 1169,
      "Univ": 1170,
      "master": 1171,
      "restrict": 1172,
      "contributed": 1173,
      "program": 1174,
      "calculation": 1175,
      "(%": 1176,
      ")]": 1177,
      "-=": 1178,
      "149": 1179,
      "24": 1180,
      "527": 1181,
      "531": 1182,
      "523": 1183,
      "<<": 1184,
      "Ab": 1185,
      "Bo": 1186,
      "Ch": 1187,
      "GA": 1188,
      "Get": 1189,
      "TT": 1190,
      "Ta": 1191,
      "Write": 1192,
      "]@": 1193,
      "]++;": 1194,
      "_task": 1195,
      "_wi": 1196,
      "_2d": 1197,
      "_imper": 1198,
      "_Bo": 1199,
      "aj": 1200,
      "cu": 1201,
      "cer": 1202,
      "dth": 1203,
      "ev": 1204,
      "ecu": 1205,
      "gg": 1206,
      "j2": 1207,
      "k2": 1208,
      "nt": 1209,
      "per": 1210,
      "qq": 1211,
      "rd": 1212,
      "ss": 1213,
      "sz": 1214,
      "tou": 1215,
      "ting": 1216,
      "up": 1217,
      "war": 1218,
      "x1": 1219,
      "x10": 1220,
      "{}": 1221,
      "-((-": 1222,
      "ori": 1223,
      "orting": 1224,
      "?(((": 1225,
      "pre": 1226,
      "++,": 1227,
      "0000": 1228,
      "test": 1229,
      "(((((((((": 1230,
      "))?(((((((": 1231,
      "thrd": 1232,
      "().": 1233,
      "()==": 1234,
      "variable": 1235,
      "992": 1236,
      "outLen": 1237,
      "cess": 1238,
      "num_sz": 1239,
      "uling": 1240,
      "initial": 1241,
      "dire": 1242,
      "const": 1243,
      "allocate": 1244,
      "tmp1": 1245,
      "val_wi": 1246,
      "barrier_destroy": 1247,
      "barrier_init": 1248,
      "ments": 1249,
      "matrix": 1250,
      "scheduling": 1251,
      "lap": 1252,
      "matchMis": 1253,
      "...\\": 1254,
      "kernel_jacobi": 1255,
      "kernel_3mm": 1256,
      "kernel_adi": 1257,
      "elements": 1258,
      "consume": 1259,
      "produce": 1260,
      "incr_a": 1261,
      "execu": 1262,
      "gen_task": 1263,
      "trigg": 1264,
      "barrier_stop": 1265,
      "barrier_start": 1266,
      "missing": 1267,
      "nEle": 1268,
      "values": 1269,
      "Produ": 1270,
      "Consum": 1271,
      "interval_wi": 1272,
      "remove": 1273,
      "segments": 1274,
      "1492": 1275,
      "Aborting": 1276,
      "Child": 1277,
      "Task": 1278,
      "Write_set": 1279,
      "_2d_imper": 1280,
      "_Bool": 1281,
      "even": 1282,
      "touched": 1283,
      "x1024": 1284,
      "matchMissmatchScore": 1285,
      "kernel_jacobi_2d_imper": 1286,
      "execution": 1287,
      "trigger": 1288,
      "interval_width": 1289,
      ")][": 1290,
      "70": 1291,
      "Alloc": 1292,
      "Element": 1293,
      "Fib": 1294,
      "Function": 1295,
      "Gu": 1296,
      "Gen": 1297,
      "NON": 1298,
      "PI": 1299,
      "Pu": 1300,
      "Rice": 1301,
      "Yi": 1302,
      "_c": 1303,
      "_sum": 1304,
      "ax": 1305,
      "ay": 1306,
      "afe": 1307,
      "bou": 1308,
      "col": 1309,
      "cil": 1310,
      "cla": 1311,
      "fine": 1312,
      "fai": 1313,
      "gin": 1314,
      "ip": 1315,
      "j1": 1316,
      "k1": 1317,
      "ld": 1318,
      "lim": 1319,
      "my": 1320,
      "nv": 1321,
      "nDiag": 1322,
      "ops": 1323,
      "pen": 1324,
      "pScore": 1325,
      "qu": 1326,
      "q_c": 1327,
      "r1": 1328,
      "rpo": 1329,
      "su": 1330,
      "safe": 1331,
      "tx": 1332,
      "tol": 1333,
      "tter": 1334,
      "vel": 1335,
      "v_sum": 1336,
      "we": 1337,
      "wo": 1338,
      "wor": 1339,
      "zi": 1340,
      "insert": 1341,
      "letter": 1342,
      "level": 1343,
      "ould": 1344,
      "dela": 1345,
      "sition": 1346,
      "sten": 1347,
      "ret": 1348,
      "refine": 1349,
      "aling": 1350,
      "lures": 1351,
      "seq_c": 1352,
      "tera": 1353,
      "parent": 1354,
      "skip": 1355,
      "omp_set_nest_lock": 1356,
      "should": 1357,
      "ass": 1358,
      "ines": 1359,
      "num_steps": 1360,
      "dition": 1361,
      "omp_unset_nest_lock": 1362,
      "due": 1363,
      "2000": 1364,
      "256": 1365,
      "tempfile": 1366,
      "omp_get_num_threads": 1367,
      "nowait": 1368,
      "thread_lim": 1369,
      "pairs": 1370,
      "copy": 1371,
      "expected": 1372,
      "signaling": 1373,
      "nElement": 1374,
      "position": 1375,
      "value": 1376,
      "gapScore": 1377,
      "m_pd": 1378,
      "m_nv": 1379,
      "similarityScore": 1380,
      "omega": 1381,
      "Calculate": 1382,
      "origin": 1383,
      "prede": 1384,
      "lapse": 1385,
      "Allocates": 1386,
      "NONE": 1387,
      "Purpo": 1388,
      "Yizi": 1389,
      "bound": 1390,
      "collapse": 1391,
      "cil_": 1392,
      "clause": 1393,
      "failures": 1394,
      "mytempfile": 1395,
      "safelen": 1396,
      "txt": 1397,
      "work": 1398,
      "delay": 1399,
      "stencil_": 1400,
      "seq_cst": 1401,
      "teration": 1402,
      "thread_limit": 1403,
      "m_pdv_sum": 1404,
      "m_nvol": 1405,
      "original": 1406,
      "Purpose": 1407,
      "',": 1408,
      "'←": 1409,
      "'↑": 1410,
      "):": 1411,
      ")=%": 1412,
      ")++;": 1413,
      ")][-": 1414,
      "*));": 1415,
      "**)": 1416,
      "0f": 1417,
      "054": 1418,
      "40": 1419,
      "400": 1420,
      "56": 1421,
      "62": 1422,
      "66": 1423,
      "923": 1424,
      ":%": 1425,
      ">-": 1426,
      "?-((-": 1427,
      "AG": 1428,
      "AL": 1429,
      "ATT": 1430,
      "BU": 1431,
      "CA": 1432,
      "CTT": 1433,
      "DE": 1434,
      "DI": 1435,
      "De": 1436,
      "Del": 1437,
      "Ex": 1438,
      "FT": 1439,
      "First": 1440,
      "HS": 1441,
      "Hel": 1442,
      "M_": 1443,
      "Mat": 1444,
      "RHS": 1445,
      "Ste": 1446,
      "Sum": 1447,
      "TH": 1448,
      "Two": 1449,
      "UP": 1450,
      "Wu": 1451,
      "Wen": 1452,
      "]<=": 1453,
      "]==": 1454,
      "]};": 1455,
      "_input": 1456,
      "_nest_lock": 1457,
      "_from": 1458,
      "af": 1459,
      "ach": 1460,
      "ack": 1461,
      "ang": 1462,
      "ail": 1463,
      "awar": 1464,
      "bal": 1465,
      "bet": 1466,
      "back": 1467,
      "ci": 1468,
      "cti": 1469,
      "calloc": 1470,
      "cted": 1471,
      "dri": 1472,
      "eg": 1473,
      "est": 1474,
      "eff": 1475,
      "flush": 1476,
      "fail": 1477,
      "ire": 1478,
      "iteration": 1479,
      "li": 1480,
      "ly": 1481,
      "line": 1482,
      "me": 1483,
      "mu": 1484,
      "men": 1485,
      "mer": 1486,
      "mit": 1487,
      "ning": 1488,
      "over": 1489,
      "pass": 1490,
      "sy": 1491,
      "sin": 1492,
      "sam": 1493,
      "srand": 1494,
      "some": 1495,
      "tra": 1496,
      "x1000": 1497,
      "xinout": 1498,
      "zer": 1499,
      "{&": 1500,
      "{};": 1501,
      "orag": 1502,
      "?(((((": 1503,
      "?((((((": 1504,
      "++]": 1505,
      "deallocate": 1506,
      "stprivate": 1507,
      "storag": 1508,
      "reas": 1509,
      "rela": 1510,
      "allow": 1511,
      "--){": 1512,
      "load": 1513,
      "loops": 1514,
      "lobal": 1515,
      "setu": 1516,
      "seed": 1517,
      "sent": 1518,
      "tected": 1519,
      "texinout": 1520,
      "((((((((": 1521,
      "chang": 1522,
      "erates": 1523,
      "omp_nest_lock": 1524,
      "omp_set_": 1525,
      "===": 1526,
      "taskloop": 1527,
      "1001": 1528,
      "t_nest_lock": 1529,
      "add": 1530,
      "ad_set": 1531,
      "there": 1532,
      "1048": 1533,
      "10x1024": 1534,
      "dataset": 1535,
      "))))?(((": 1536,
      "2048": 1537,
      "20x1000": 1538,
      "num_refine": 1539,
      "coef": 1540,
      "coeff": 1541,
      "dimen": 1542,
      "fopen": 1543,
      "497": 1544,
      "condition": 1545,
      "stant": 1546,
      "maxim": 1547,
      "geable": 1548,
      "omp_init_nest_lock": 1549,
      "omp_destroy_nest_lock": 1550,
      "now": 1551,
      "phen": 1552,
      "lastprivate": 1553,
      "Note": 1554,
      "...": 1555,
      "LEFT": 1556,
      "consumer": 1557,
      "producer": 1558,
      "exit": 1559,
      "checking": 1560,
      "Because": 1561,
      "Defines": 1562,
      "Present": 1563,
      "lld": 1564,
      "missmatchScore": 1565,
      "within": 1566,
      "ONAL": 1567,
      "Real": 1568,
      "Read_set": 1569,
      "Size": 1570,
      "Sieg": 1571,
      "access": 1572,
      "acqu": 1573,
      "hao": 1574,
      "have": 1575,
      "calcFirst": 1576,
      "DiagElement": 1577,
      "Calculates": 1578,
      "GAATT": 1579,
      "GACTT": 1580,
      "pers": 1581,
      "warning": 1582,
      "variables": 1583,
      "cessor": 1584,
      "direction": 1585,
      "directi": 1586,
      "Produced": 1587,
      "Producer": 1588,
      "Consumer": 1589,
      "Consumed": 1590,
      "Generates": 1591,
      "copyin": 1592,
      "predecessor": 1593,
      "stencil_calc": 1594,
      "'←'": 1595,
      "'↑'": 1596,
      "0543": 1597,
      "4000": 1598,
      "AGONAL": 1599,
      "BUG": 1600,
      "DEBUG": 1601,
      "DIAGONAL": 1602,
      "Delawar": 1603,
      "Expected": 1604,
      "Helpers": 1605,
      "M_PI": 1606,
      "Matrix": 1607,
      "Stephen": 1608,
      "Wenhao": 1609,
      "_from_input": 1610,
      "after": 1611,
      "backtra": 1612,
      "driver": 1613,
      "fails": 1614,
      "linear": 1615,
      "mutexinout": 1616,
      "mergeable": 1617,
      "mits": 1618,
      "sink": 1619,
      "same": 1620,
      "zeros": 1621,
      "storage": 1622,
      "reasing": 1623,
      "relax": 1624,
      "load_from_input": 1625,
      "setup": 1626,
      "change": 1627,
      "omp_nest_lock_t": 1628,
      "10x1024x1024": 1629,
      "dimensi": 1630,
      "stants": 1631,
      "maximum": 1632,
      "Siegel": 1633,
      "acquire": 1634,
      "calcFirstDiagElement": 1635,
      "GAATTCA": 1636,
      "directive": 1637,
      "Delaware": 1638,
      "backtrack": 1639,
      "mutexinoutset": 1640,
      "\"%": 1641,
      "\"<<": 1642,
      "())": 1643,
      ")-": 1644,
      ")\\": 1645,
      "+\");": 1646,
      "/(": 1647,
      "/((": 1648,
      "01": 1649,
      "05": 1650,
      "26": 1651,
      "28": 1652,
      "30": 1653,
      "34": 1654,
      "97": 1655,
      ";}": 1656,
      "Al": 1657,
      "An": 1658,
      "ATH": 1659,
      "Aach": 1660,
      "CP": 1661,
      "Cl": 1662,
      "Co": 1663,
      "Cent": 1664,
      "Cop": 1665,
      "FI": 1666,
      "Global": 1667,
      "Iteration": 1668,
      "Jo": 1669,
      "Lo": 1670,
      "Lines": 1671,
      "PATH": 1672,
      "RW": 1673,
      "Rand": 1674,
      "Ref": 1675,
      "Sim": 1676,
      "To": 1677,
      "Tim": 1678,
      "Test": 1679,
      "Upd": 1680,
      "We": 1681,
      "Wi": 1682,
      "[*": 1683,
      "[]": 1684,
      "]\\": 1685,
      "_s": 1686,
      "_pro": 1687,
      "_li": 1688,
      "ab": 1689,
      "bl": 1690,
      "bs": 1691,
      "bta": 1692,
      "clo": 1693,
      "ctu": 1694,
      "cout": 1695,
      "cassert": 1696,
      "carri": 1697,
      "creasing": 1698,
      "erence": 1699,
      "fault": 1700,
      "fclo": 1701,
      "gr": 1702,
      "gma": 1703,
      "gni": 1704,
      "gone": 1705,
      "gge": 1706,
      "global": 1707,
      "has": 1708,
      "id": 1709,
      "ich": 1710,
      "ient": 1711,
      "ista": 1712,
      "kes": 1713,
      "mn": 1714,
      "mine": 1715,
      "mul": 1716,
      "mset": 1717,
      "mista": 1718,
      "nc": 1719,
      "none": 1720,
      "nMatrix": 1721,
      "ove": 1722,
      "oops": 1723,
      "obta": 1724,
      "ple": 1725,
      "ping": 1726,
      "pat": 1727,
      "ppen": 1728,
      "qr": 1729,
      "ral": 1730,
      "ron": 1731,
      "ring": 1732,
      "rce": 1733,
      "sb": 1734,
      "sf": 1735,
      "sm": 1736,
      "sw": 1737,
      "sou": 1738,
      "scor": 1739,
      "score": 1740,
      "smatch": 1741,
      "sqr": 1742,
      "tw": 1743,
      "tal": 1744,
      "tze": 1745,
      "two": 1746,
      "user": 1747,
      "upd": 1748,
      "ved": 1749,
      "ving": 1750,
      "wtime": 1751,
      "wron": 1752,
      "inste": 1753,
      "1500": 1754,
      "lete": 1755,
      "ores": 1756,
      "orted": 1757,
      "matic": 1758,
      "makes": 1759,
      "into": 1760,
      "][%": 1761,
      "oup": 1762,
      "deri": 1763,
      "dence": 1764,
      "decreasing": 1765,
      "delete": 1766,
      "sic": 1767,
      "sidu": 1768,
      "stre": 1769,
      "sted": 1770,
      "start": 1771,
      "reco": 1772,
      "requ": 1773,
      "alread": 1774,
      "simul": 1775,
      "lution": 1776,
      "lumn": 1777,
      "tiple": 1778,
      "ify": 1779,
      "ifdef": 1780,
      "tern": 1781,
      "tection": 1782,
      "location": 1783,
      "ensu": 1784,
      "endence": 1785,
      "ones": 1786,
      "onac": 1787,
      "returns": 1788,
      "\",\"": 1789,
      "iostre": 1790,
      "zed": 1791,
      "thout": 1792,
      "this": 1793,
      "()%": 1794,
      "()\\": 1795,
      "taskgr": 1796,
      "])/": 1797,
      "addition": 1798,
      "endl": 1799,
      "endif": 1800,
      "asso": 1801,
      "assic": 1802,
      "unable": 1803,
      "dependence": 1804,
      "serve": 1805,
      "serts": 1806,
      "2015": 1807,
      "2040": 1808,
      "arrays": 1809,
      "pace": 1810,
      "dir": 1811,
      "constants": 1812,
      "stable": 1813,
      "stack": 1814,
      "espace": 1815,
      "tomatic": 1816,
      "proper": 1817,
      "protected": 1818,
      "protection": 1819,
      "termin": 1820,
      "termine": 1821,
      "2560": 1822,
      "icient": 1823,
      "publ": 1824,
      "because": 1825,
      "but": 1826,
      "busy": 1827,
      "ctori": 1828,
      "causing": 1829,
      "valid": 1830,
      "error_t": 1831,
      "indexing": 1832,
      "which": 1833,
      "**));": 1834,
      "***)": 1835,
      "****": 1836,
      "***));": 1837,
      "****)": 1838,
      "omp_get_max_": 1839,
      "omp_get_wtime": 1840,
      "vectori": 1841,
      "node": 1842,
      "labs": 1843,
      "results": 1844,
      "Inserts": 1845,
      "answ": 1846,
      "each": 1847,
      "517": 1848,
      "Initial": 1849,
      "structu": 1850,
      "new_pro": 1851,
      "832040": 1852,
      "]*(": 1853,
      "]*=": 1854,
      "name": 1855,
      "namespace": 1856,
      "increasing": 1857,
      "compared": 1858,
      "rectly": 1859,
      "strings": 1860,
      "String": 1861,
      "Stores": 1862,
      "automatic": 1863,
      "solution": 1864,
      "200000000": 1865,
      "class": 1866,
      "missmatch": 1867,
      "pointer": 1868,
      "phabet": 1869,
      "Variables": 1870,
      "Directly": 1871,
      "Proper": 1872,
      "Protze": 1873,
      "move": 1874,
      "alphabet": 1875,
      "Constants": 1876,
      "Missing": 1877,
      "Residu": 1878,
      "Sigma": 1879,
      "happen": 1880,
      "verify": 1881,
      "removing": 1882,
      "calcElement": 1883,
      "<<\"": 1884,
      "Gets": 1885,
      "preserve": 1886,
      "00000000": 1887,
      "initialTim": 1888,
      "matrixes": 1889,
      "lapping": 1890,
      "Fibonac": 1891,
      "sublock": 1892,
      "sugge": 1893,
      "copyprivate": 1894,
      "predetermin": 1895,
      "stencil_in": 1896,
      "Detected": 1897,
      "Determine": 1898,
      "achim": 1899,
      "ciate": 1900,
      "ested": 1901,
      "like": 1902,
      "mesh": 1903,
      "memset": 1904,
      "overlapping": 1905,
      "sync": 1906,
      "allows": 1907,
      "omp_set_num_threads": 1908,
      "omp_set_dynamic": 1909,
      "addlock": 1910,
      "add_s": 1911,
      "coefficient": 1912,
      "dimension": 1913,
      "dimensional": 1914,
      "())/((": 1915,
      "Alphabet": 1916,
      "Any": 1917,
      "Aachen": 1918,
      "CPU": 1919,
      "Classic": 1920,
      "Column": 1921,
      "Central": 1922,
      "Copy": 1923,
      "FILE": 1924,
      "Iterations": 1925,
      "Joachim": 1926,
      "Loop": 1927,
      "RWTH": 1928,
      "Random": 1929,
      "Reference": 1930,
      "Similarity": 1931,
      "Total": 1932,
      "Updates": 1933,
      "Without": 1934,
      "_list": 1935,
      "above": 1936,
      "carried": 1937,
      "fclose": 1938,
      "gnized": 1939,
      "multiple": 1940,
      "mistake": 1941,
      "obtain": 1942,
      "pattern": 1943,
      "source": 1944,
      "scores": 1945,
      "sqrt": 1946,
      "twice": 1947,
      "update": 1948,
      "wrong": 1949,
      "instead": 1950,
      "orted_list": 1951,
      "derived": 1952,
      "recognized": 1953,
      "requested": 1954,
      "already": 1955,
      "simulate": 1956,
      "ensure": 1957,
      "iostream": 1958,
      "taskgroup": 1959,
      "associate": 1960,
      "properly": 1961,
      "public": 1962,
      "error_tol": 1963,
      "omp_get_max_threads": 1964,
      "vectorization": 1965,
      "answer": 1966,
      "structure": 1967,
      "new_proc": 1968,
      "Strings": 1969,
      "pointers": 1970,
      "Residual": 1971,
      "happens": 1972,
      "0000000001": 1973,
      "initialTime": 1974,
      "Fibonacci": 1975,
      "suggested": 1976,
      "predetermined": 1977,
      "add_sorted_list": 1978,
      "coefficients": 1979,
      "Columns": 1980,
      "References": 1981
    },
    "merges": [
      "1 6",
      "( (",
      ") )",
      "c 2",
      "n j",
      "c 4",
      "i n",
      "- (",
      "n k",
      "1 5",
      "c 3",
      "- ((",
      "-(( -(",
      "c 1",
      "n l",
      "n m",
      "l e",
      "o r",
      "f or",
      "? ((",
      "p r",
      "m a",
      "+ +",
      "m p",
      "in t",
      "++ )",
      "o mp",
      "] [",
      "< =",
      "n i",
      "o u",
      ")) )",
      "a g",
      "pr ag",
      "prag ma",
      "b le",
      "d ou",
      "a r",
      "dou ble",
      ")) ;",
      "? -((-(",
      "(( (",
      ") ;",
      "d e",
      "s i",
      "s t",
      "r e",
      "a l",
      "si m",
      "l u",
      "- -",
      "sim d",
      "0 0",
      "c lu",
      "clu de",
      "in clude",
      "t i",
      "i f",
      "l o",
      ")) ))",
      "s e",
      "1 2",
      "( -",
      "? -(",
      "? (-",
      "?-( -",
      "t e",
      "lo c",
      "(( ((",
      "le n",
      "p ar",
      "le l",
      "al lel",
      "par allel",
      "st d",
      "u m",
      "e n",
      "ar g",
      "pr int",
      "o n",
      "r n",
      "t a",
      "print f",
      "c h",
      "t u",
      ")) ?((",
      "re tu",
      "retu rn",
      "-- --",
      "ma in",
      "( \"",
      "] ;",
      "\" ,",
      "loc k",
      "e r",
      "/ /",
      "i o",
      "std io",
      "z e",
      "12 8",
      "t h",
      "))?(( (",
      "( )",
      "s k",
      "5 00",
      "> =",
      "r i",
      "omp _",
      "v ar",
      "= =",
      "= %",
      "c 0",
      "ta sk",
      "si ze",
      "s um",
      "* /",
      "/ *",
      "1 9",
      "a te",
      "1 00",
      "ti on",
      "o i",
      "& &",
      "] )",
      "o f",
      "( &",
      "t _",
      "e d",
      "i v",
      ")) )))",
      "pr iv",
      "priv ate",
      "v oi",
      "voi d",
      "a d",
      "arg c",
      "arg v",
      "r a",
      "] );",
      "---- ----",
      "(( (((",
      "c 8",
      "n um",
      "] ,",
      "i b",
      "i t",
      "o l",
      "ti d",
      "p s",
      "] =",
      "st e",
      "t_ lock",
      "ste ps",
      "re ad",
      "s h",
      "in g",
      "en d",
      "1 3",
      "c tion",
      ")) ));",
      "c 5",
      "e l",
      "y b",
      "9 9",
      "t steps",
      "ch ar",
      "ou t",
      "c k",
      "en ch",
      "se t_lock",
      "a s",
      "de f",
      "u n",
      "a ta",
      "c e",
      "p ol",
      "de p",
      "yb ench",
      "pol ybench",
      "* )",
      "c 15",
      "l ib",
      "se r",
      "std lib",
      "dep end",
      "ti c",
      "th e",
      "ser t",
      "ar ed",
      "th read",
      "[ ])",
      "sh ared",
      "1 0",
      "n d",
      "r o",
      "size of",
      "as sert",
      "( );",
      "ra y",
      "))))) ;",
      "+ =",
      "a it",
      "d ata",
      "w ait",
      ")))) ?((",
      "ar ri",
      "() {",
      "2 0",
      "] =%",
      "f re",
      "in e",
      "++) {",
      "arri er",
      "fre e",
      "b lock",
      "e t",
      "num _",
      "u l",
      "ar ray",
      "a t",
      "c 9",
      "++ ;",
      "3 2",
      "in i",
      "2 9",
      "6 5",
      "a m",
      "n g",
      "c o",
      "i s",
      "s ing",
      "se ction",
      "l loc",
      "lo ng",
      "def ine",
      "b arrier",
      "100 0",
      "(\" %",
      "a se",
      "c 7",
      "p a",
      "c1 0",
      "ma lloc",
      "ti m",
      "task wait",
      "-------- --------",
      "polybench _",
      "5 0",
      "d i",
      "1 8",
      "x a",
      "en t",
      "f o",
      "))?(( (((",
      "omp_ un",
      "4 9",
      "c on",
      "i l",
      "de r",
      "st a",
      "el se",
      "4 8",
      "5 5",
      "c ou",
      "e s",
      "t o",
      "pr o",
      "al loc",
      "ul t",
      "fo o",
      "cou n",
      "\" );",
      "[ -",
      "d u",
      "omp_ set_lock",
      "sing le",
      "omp_un set_lock",
      "b ase",
      "l ck",
      "r or",
      "t mp",
      "2 00",
      "- >",
      "6 3",
      "l 0",
      "l 1",
      "ti al",
      "te r",
      "sta tic",
      "( *",
      "2 5",
      "a tion",
      "c ri",
      "i c",
      "ma p",
      "(((( (((",
      "tic al",
      "ro m",
      "cri tical",
      "5 7",
      "8 9",
      "(((( ((",
      "tim er",
      "T h",
      "p u",
      "?(( ((",
      "))) ;",
      "te am",
      "team s",
      "_ lock",
      "b e",
      "b u",
      "][ -",
      "st r",
      "on e",
      "sum 1",
      "pu t",
      "c t",
      "d x",
      "t arg",
      "ma x",
      "thread s",
      "tial i",
      "targ et",
      "6 0",
      "c a",
      "c or",
      "f printf",
      "i r",
      "k e",
      "u 1",
      "v al",
      "st ri",
      "12 7",
      "er ror",
      "at oi",
      "barrier _",
      "bu te",
      ", (",
      "6 1",
      "_ size",
      "_ block",
      "i le",
      "i ce",
      "in de",
      "in out",
      "st der",
      "19 0",
      "13 0",
      "num_ threads",
      "coun ter",
      "_block _size",
      "inde x",
      "stder r",
      "( *)",
      ") [",
      "2 1",
      "2 7",
      "_ data",
      "n e",
      "p e",
      "w h",
      ")) ,(",
      "rn el",
      "]) (",
      "ck ag",
      "pa ckag",
      "polybench_ alloc",
      "ke rnel",
      "(*) [",
      "polybench_alloc _data",
      "_ t",
      "t of",
      "re s",
      "te mp",
      "tof rom",
      "( -(",
      "? (-(",
      "a nd",
      "a ult",
      "c al",
      "g e",
      "de st",
      "?-( -(",
      "sum 0",
      "ro y",
      "dest roy",
      "3 3",
      "] +",
      "m ent",
      "v ice",
      "de vice",
      "di stri",
      "tiali ze",
      "distri bute",
      "* *",
      "6 7",
      "6 9",
      "9 4",
      "d y",
      "o m",
      "o p",
      "16 4",
      "in it",
      "15 9",
      "12 0",
      "ch ed",
      "19 8",
      "block s",
      "18 7",
      "xa 1",
      "xa 2",
      "! =",
      ", \"",
      "3 1",
      "b y",
      "u se",
      "x x",
      "y y",
      "omp_ ge",
      "omp_ge t_",
      "7 1",
      "I Z",
      "M S",
      "[ %",
      "c 6",
      "d one",
      "f f",
      "f ib",
      "l 2",
      "u 2",
      "v e",
      "ma t",
      "ar t",
      "lu sh",
      ")))) ))",
      ")))) )))",
      "omp_ ini",
      "omp_ destroy",
      "---------------- ----------------",
      "polybench_ timer",
      "packag es",
      "IZ E",
      "MS IZE",
      "polybench_timer _",
      "n o",
      "p h",
      "le ment",
      "ra ce",
      "thread _",
      "section s",
      "pa ir",
      "il d",
      "Th read",
      "wh ile",
      "( +",
      ") {",
      "1 1",
      "1 st",
      "2 3",
      "2 nd",
      "b p",
      "f 1",
      "i dx",
      "m in",
      "s ched",
      "dou t",
      "st dout",
      "re du",
      "un ction",
      "49 8",
      "cor e",
      "ff lush",
      "omp_ini t_lock",
      "omp_destroy _lock",
      "(+ :",
      "redu ction",
      "3 5",
      "3 7",
      "3 9",
      "5 9",
      "6 4",
      "] +=",
      "l a",
      "15 4",
      "// #",
      "19 7",
      "def ault",
      "co p",
      "1 4",
      "5 21",
      "N o",
      "S et",
      "S core",
      "a ble",
      "in put",
      "-- ;",
      "out put",
      "at om",
      "index Set",
      "res ult",
      "omp_get_ thread_",
      "mat ch",
      "atom ic",
      "omp_get_thread_ num",
      ") /",
      "4 99",
      "I n",
      "L en",
      "a n",
      "e a",
      "f unction",
      "t y",
      ")))) ?",
      "ch ild",
      "128 5",
      "99 9",
      "ty pe",
      ". .",
      "5 1",
      "I ni",
      "] !=",
      "_ array",
      "b er",
      "h ea",
      "i 2",
      "l iv",
      "m m",
      "s cop",
      "u le",
      "u st",
      "st _lock",
      "print _array",
      "t_ array",
      "ini t_array",
      "co de",
      "str u",
      "ca p",
      "ne w",
      "ne st_lock",
      "kernel _",
      "cal l",
      ",\" \\",
      "polybench_timer_ st",
      "sched ule",
      "In clude",
      "hea der",
      "liv e",
      "8 3",
      "L E",
      "] *",
      "e f",
      "e lement",
      "i able",
      "n am",
      "u ni",
      "v s",
      "w i",
      "in c",
      "ma th",
      "se t",
      "ra nd",
      "20 13",
      "con sum",
      "pro du",
      "coun t",
      "pe c",
      "Ini tialize",
      "stru ct",
      "uni std",
      "1 7",
      "2 l",
      "5 3",
      "7 3",
      "8 1",
      "8 7",
      "D ata",
      "c omp",
      "c ul",
      "f e",
      "f l",
      "m yb",
      "n pro",
      "r _",
      "} ;",
      "or de",
      "ag _t",
      "de s",
      "re d",
      "re ct",
      "lock _t",
      "omp_ lock_t",
      "num No",
      "ol d",
      "thread private",
      "ini tialize",
      "di ag",
      "str ing",
      "barrier_ wait",
      "new S",
      "inc r_",
      "2l f",
      "fl ag_t",
      "myb arrier",
