{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "_": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "}": 92,
      "←": 93,
      "↑": 94,
      "↖": 95,
      "16": 96,
      "((": 97,
      "))": 98,
      "in": 99,
      "c2": 100,
      "nj": 101,
      "c4": 102,
      "-(": 103,
      "nk": 104,
      "15": 105,
      "c3": 106,
      "or": 107,
      "-((": 108,
      "-((-(": 109,
      "le": 110,
      "int": 111,
      "for": 112,
      "c1": 113,
      "nl": 114,
      "ma": 115,
      "nm": 116,
      "pr": 117,
      "om": 118,
      "++": 119,
      "omp": 120,
      "?((": 121,
      "++)": 122,
      "ou": 123,
      "ar": 124,
      "ag": 125,
      "][": 126,
      "prag": 127,
      "pragma": 128,
      "<=": 129,
      "ni": 130,
      ")))": 131,
      "ble": 132,
      "dou": 133,
      "de": 134,
      "double": 135,
      ");": 136,
      "));": 137,
      "?-((-(": 138,
      "st": 139,
      "(((": 140,
      "te": 141,
      "si": 142,
      "re": 143,
      "00": 144,
      "al": 145,
      "cl": 146,
      "clu": 147,
      "clude": 148,
      "lo": 149,
      "include": 150,
      "sim": 151,
      "simd": 152,
      "ck": 153,
      "--": 154,
      "se": 155,
      "ti": 156,
      "if": 157,
      "rn": 158,
      "std": 159,
      "tu": 160,
      "retu": 161,
      "return": 162,
      "12": 163,
      "))))": 164,
      "var": 165,
      "(-": 166,
      "()": 167,
      "?-(": 168,
      "lock": 169,
      "arg": 170,
      "par": 171,
      "lel": 172,
      "allel": 173,
      "parallel": 174,
      "oun": 175,
      "?(-": 176,
      "?-(-": 177,
      "coun": 178,
      "print": 179,
      "len": 180,
      "um": 181,
      "((((": 182,
      "en": 183,
      "ch": 184,
      "printf": 185,
      "];": 186,
      "main": 187,
      "on": 188,
      "(\"": 189,
      "stdi": 190,
      "stdio": 191,
      "\",": 192,
      "ta": 193,
      "100": 194,
      "ter": 195,
      "counter": 196,
      "omp_": 197,
      "]=": 198,
      "ri": 199,
      "))?((": 200,
      "----": 201,
      "er": 202,
      "it": 203,
      "(){": 204,
      "//": 205,
      "of": 206,
      "(&": 207,
      "ze": 208,
      "th": 209,
      "++){": 210,
      "countervar": 211,
      "128": 212,
      "])": 213,
      "_lock": 214,
      "))?(((": 215,
      "ad": 216,
      "sk": 217,
      "();": 218,
      "size": 219,
      "ate": 220,
      "task": 221,
      "sum": 222,
      "500": 223,
      ">=": 224,
      "ol": 225,
      "==": 226,
      "c0": 227,
      "ce": 228,
      "oi": 229,
      "tion": 230,
      "*/": 231,
      "/*": 232,
      "19": 233,
      "iv": 234,
      "def": 235,
      "&&": 236,
      "et": 237,
      "ed": 238,
      "priv": 239,
      "private": 240,
      "ine": 241,
      ")))))": 242,
      "set": 243,
      "],": 244,
      "voi": 245,
      "void": 246,
      "am": 247,
      "init": 248,
      "num": 249,
      "argc": 250,
      "argv": 251,
      "define": 252,
      "ib": 253,
      "ra": 254,
      "loc": 255,
      "]);": 256,
      "--------": 257,
      "(((((": 258,
      "c8": 259,
      "set_lock": 260,
      "di": 261,
      "end": 262,
      "read": 263,
      "tid": 264,
      "block": 265,
      "mp": 266,
      "ps": 267,
      "=%": 268,
      "ste": 269,
      "steps": 270,
      "ction": 271,
      "sh": 272,
      "vi": 273,
      "ing": 274,
      "su": 275,
      "targ": 276,
      "target": 277,
      "13": 278,
      "))));": 279,
      "map": 280,
      "out": 281,
      "c5": 282,
      "team": 283,
      "teams": 284,
      "lib": 285,
      "un": 286,
      "tic": 287,
      "stdlib": 288,
      "char": 289,
      "++;": 290,
      "el": 291,
      "yb": 292,
      "99": 293,
      "rom": 294,
      "tsteps": 295,
      "count": 296,
      "bu": 297,
      "test": 298,
      "ench": 299,
      "as": 300,
      "pend": 301,
      "*)": 302,
      "sizeof": 303,
      "depend": 304,
      "num_": 305,
      "ata": 306,
      "pol": 307,
      "stri": 308,
      "thread": 309,
      "ybench": 310,
      "bute": 311,
      "polybench": 312,
      "at": 313,
      "c15": 314,
      "ser": 315,
      "ared": 316,
      "[])": 317,
      "fre": 318,
      "the": 319,
      "shared": 320,
      "sert": 321,
      "free": 322,
      "+=": 323,
      "10": 324,
      "devi": 325,
      "str": 326,
      "device": 327,
      "distri": 328,
      "distribute": 329,
      "\");": 330,
      "ait": 331,
      "pa": 332,
      "tof": 333,
      "wait": 334,
      "tofrom": 335,
      "to": 336,
      "assert": 337,
      "nd": 338,
      "ue": 339,
      "ray": 340,
      "ul": 341,
      ")))));": 342,
      "data": 343,
      "))))?((": 344,
      "eck": 345,
      "arri": 346,
      "check": 347,
      "20": 348,
      "lloc": 349,
      "]=%": 350,
      "arrier": 351,
      "array": 352,
      "c9": 353,
      "ool": 354,
      "malloc": 355,
      "32": 356,
      "fo": 357,
      "omp_un": 358,
      "29": 359,
      "_t": 360,
      "tr": 361,
      "is": 362,
      "section": 363,
      "1000": 364,
      "foo": 365,
      "65": 366,
      "bool": 367,
      "fal": 368,
      "ng": 369,
      "omp_set_lock": 370,
      "omp_unset_lock": 371,
      "true": 372,
      "false": 373,
      "sing": 374,
      "add": 375,
      "cri": 376,
      "long": 377,
      "tical": 378,
      "critical": 379,
      "){": 380,
      "barrier": 381,
      "val": 382,
      "pe": 383,
      "(\"%": 384,
      "taskwait": 385,
      "!=": 386,
      "ase": 387,
      "c7": 388,
      "co": 389,
      "c10": 390,
      "000": 391,
      "tim": 392,
      "----------------": 393,
      "polybench_": 394,
      "50": 395,
      "ke": 396,
      "ent": 397,
      "18": 398,
      "il": 399,
      "xa": 400,
      "48": 401,
      "sta": 402,
      "temp": 403,
      "))?(((((": 404,
      "49": 405,
      "]+": 406,
      "con": 407,
      "pu": 408,
      "der": 409,
      "sublock": 410,
      "else": 411,
      "addlock": 412,
      "55": 413,
      "ile": 414,
      "pro": 415,
      "alloc": 416,
      "[-": 417,
      "]!=": 418,
      "ic": 419,
      "ne": 420,
      "ss": 421,
      "single": 422,
      "ation": 423,
      "base": 424,
      "cor": 425,
      "du": 426,
      "lck": 427,
      "oy": 428,
      "ror": 429,
      "tmp": 430,
      "destr": 431,
      "ult": 432,
      "destroy": 433,
      "64": 434,
      "tial": 435,
      "static": 436,
      "->": 437,
      "63": 438,
      "l0": 439,
      "l1": 440,
      "(*": 441,
      "25": 442,
      "200": 443,
      "(((((((": 444,
      "57": 445,
      "89": 446,
      "((((((": 447,
      "one": 448,
      "100000": 449,
      "omp_init": 450,
      "omp_destroy": 451,
      "timer": 452,
      "Th": 453,
      "?((((": 454,
      ")));": 455,
      "threads": 456,
      "be": 457,
      "fl": 458,
      "][-": 459,
      "sum1": 460,
      "pec": 461,
      "put": 462,
      "omp_init_lock": 463,
      "omp_destroy_lock": 464,
      "ca": 465,
      "ct": 466,
      "dx": 467,
      "ir": 468,
      "inout": 469,
      "max": 470,
      "cess": 471,
      "num_threads": 472,
      "tiali": 473,
      "60": 474,
      "fprintf": 475,
      "no": 476,
      "u1": 477,
      "age": 478,
      "127": 479,
      "error": 480,
      "atoi": 481,
      "barrier_": 482,
      ",(": 483,
      "61": 484,
      "_size": 485,
      "_block": 486,
      "ccess": 487,
      "ex": 488,
      "inde": 489,
      "stder": 490,
      "ted": 491,
      "190": 492,
      "130": 493,
      "_block_size": 494,
      "index": 495,
      "stderr": 496,
      "(*)": 497,
      ")[": 498,
      "21": 499,
      "27": 500,
      "_data": 501,
      "_array": 502,
      "ault": 503,
      "em": 504,
      "wh": 505,
      ")),(": 506,
      "ckage": 507,
      "rnel": 508,
      "stdbool": 509,
      "])(": 510,
      "package": 511,
      "polybench_alloc": 512,
      "kernel": 513,
      "(*)[": 514,
      "polybench_alloc_data": 515,
      "Access": 516,
      "Is": 517,
      "Mem": 518,
      "and": 519,
      "ment": 520,
      "op": 521,
      "ory": 522,
      "sible": 523,
      "visible": 524,
      "sue": 525,
      "Issue": 526,
      "Memory": 527,
      "(-(": 528,
      "?(-(": 529,
      "cal": 530,
      "?-(-(": 531,
      "lock_t": 532,
      "omp_lock_t": 533,
      "sum0": 534,
      "33": 535,
      "ini": 536,
      "pected": 537,
      "tialize": 538,
      "**": 539,
      "67": 540,
      "69": 541,
      "94": 542,
      "dy": 543,
      "get": 544,
      "164": 545,
      "159": 546,
      "120": 547,
      "ched": 548,
      "198": 549,
      "blocks": 550,
      "187": 551,
      "xa1": 552,
      "xa2": 553,
      "get_": 554,
      ",\"": 555,
      "31": 556,
      "In": 557,
      "by": 558,
      "file": 559,
      "nam": 560,
      "os": 561,
      "use": 562,
      "ve": 563,
      "xx": 564,
      "yy": 565,
      "art": 566,
      "omp_get_": 567,
      "thread_": 568,
      "expected": 569,
      "(+": 570,
      "71": 571,
      "IZ": 572,
      "MS": 573,
      "[%": 574,
      "c6": 575,
      "done": 576,
      "fib": 577,
      "l2": 578,
      "u2": 579,
      "ush": 580,
      "mat": 581,
      "omic": 582,
      "decl": 583,
      "redu": 584,
      "))))))": 585,
      ")))))))": 586,
      "num_teams": 587,
      "atomic": 588,
      "sections": 589,
      "--------------------------------": 590,
      "polybench_timer": 591,
      "flush": 592,
      "packages": 593,
      "(+:": 594,
      "IZE": 595,
      "MSIZE": 596,
      "declar": 597,
      "reduction": 598,
      "polybench_timer_": 599,
      "-=": 600,
      "]*": 601,
      "]+=": 602,
      "flo": 603,
      "ph": 604,
      "lement": 605,
      "default": 606,
      "race": 607,
      "pair": 608,
      "ild": 609,
      "core": 610,
      "Thread": 611,
      "while": 612,
      "float": 613,
      "11": 614,
      "1st": 615,
      "23": 616,
      "2nd": 617,
      "bp": 618,
      "f1": 619,
      "fflush": 620,
      "im": 621,
      "idx": 622,
      "sched": 623,
      "zer": 624,
      "dout": 625,
      "stdout": 626,
      "unction": 627,
      "path": 628,
      "498": 629,
      "35": 630,
      "37": 631,
      "39": 632,
      "59": 633,
      "ea": 634,
      "ef": 635,
      "from": 636,
      "154": 637,
      "//#": 638,
      "197": 639,
      "cop": 640,
      "14": 641,
      "521": 642,
      "No": 643,
      "Set": 644,
      "Score": 645,
      "]++;": 646,
      "la": 647,
      "lt": 648,
      "input": 649,
      "int64": 650,
      "nizer": 651,
      "resu": 652,
      "--;": 653,
      "output": 654,
      "code": 655,
      "kenizer": 656,
      "new": 657,
      "indexSet": 658,
      "omp_get_thread_": 659,
      "match": 660,
      "int64_t": 661,
      "result": 662,
      "omp_get_thread_num": 663,
      ")/": 664,
      "499": 665,
      "Len": 666,
      "an": 667,
      "fe": 668,
      "function": 669,
      "ty": 670,
      "))))?": 671,
      "child": 672,
      "rite": 673,
      "1285": 674,
      "999": 675,
      "nest": 676,
      "type": 677,
      "..": 678,
      "42": 679,
      "51": 680,
      "512": 681,
      "Ini": 682,
      "able": 683,
      "ber": 684,
      "hea": 685,
      "i2": 686,
      "liv": 687,
      "scop": 688,
      "ule": 689,
      "ust": 690,
      "start": 691,
      "res": 692,
      "print_array": 693,
      "init_array": 694,
      "stru": 695,
      "tokenizer": 696,
      "cap": 697,
      "kernel_": 698,
      "call": 699,
      ",\"\\": 700,
      "Include": 701,
      "declare": 702,
      "schedule": 703,
      "nest_lock": 704,
      "header": 705,
      "live": 706,
      "83": 707,
      "LE": 708,
      "_M": 709,
      "_path": 710,
      "element": 711,
      "imp": 712,
      "iable": 713,
      "sa": 714,
      "uni": 715,
      "vs": 716,
      "inc": 717,
      "math": 718,
      "rand": 719,
      "2013": 720,
      "consum": 721,
      "produ": 722,
      "Initialize": 723,
      "struct": 724,
      "unistd": 725,
      "17": 726,
      "2l": 727,
      "53": 728,
      "73": 729,
      "81": 730,
      "87": 731,
      "Be": 732,
      "Data": 733,
      "_nest_lock": 734,
      "comp": 735,
      "cul": 736,
      "gn": 737,
      "mm": 738,
      "min": 739,
      "myb": 740,
      "npro": 741,
      "r_": 742,
      "};": 743,
      "orde": 744,
      "ag_t": 745,
      "des": 746,
      "stop": 747,
      "sign": 748,
      "red": 749,
      "rect": 750,
      "ith": 751,
      "old": 752,
      "numNo": 753,
      "diag": 754,
      "threadprivate": 755,
      "string": 756,
      "flag_t": 757,
      "irst": 758,
      "barrier_wait": 759,
      "initialize": 760,
      "name": 761,
      "newS": 762,
      "incr_": 763,
      "2lf": 764,
      "mybarrier": 765,
      "nprod": 766,
      "ordered": 767,
      "numNodes": 768,
      "].": 769,
      "au": 770,
      "gen": 771,
      "nce": 772,
      "pd": 773,
      "tp": 774,
      "tri": 775,
      "uta": 776,
      "uold": 777,
      "write": 778,
      "with": 779,
      "x_block_size": 780,
      "y_block_size": 781,
      "inLen": 782,
      "ort": 783,
      "]=((": 784,
      "sum2": 785,
      "correct": 786,
      "20000": 787,
      "dynam": 788,
      "Threads": 789,
      "produce": 790,
      "computa": 791,
      "dynamic": 792,
      "computation": 793,
      "';": 794,
      ")*": 795,
      "Done": 796,
      "Def": 797,
      "Er": 798,
      "End": 799,
      "MY": 800,
      "Pre": 801,
      "St": 802,
      "_name": 803,
      "aco": 804,
      "bi": 805,
      "com": 806,
      "f0": 807,
      "first": 808,
      "jaco": 809,
      "ll": 810,
      "nsteps": 811,
      "nthread": 812,
      "sj": 813,
      "wil": 814,
      "real": 815,
      "rence": 816,
      "low": 817,
      "loop": 818,
      "argum": 819,
      "ates": 820,
      "numThreads": 821,
      "local": 822,
      "))))?((((": 823,
      "construct": 824,
      "pus": 825,
      "ness": 826,
      "corpus": 827,
      "not": 828,
      "file_name": 829,
      "phase": 830,
      "matchScore": 831,
      "LEN": 832,
      "aux": 833,
      "correctness": 834,
      "Error": 835,
      "MYLEN": 836,
      "jacobi": 837,
      "will": 838,
      "argument": 839,
      "\"))": 840,
      ").": 841,
      ".\\": 842,
      "54": 843,
      "Var": 844,
      "ap": 845,
      "gth": 846,
      "li": 847,
      "mo": 848,
      "mis": 849,
      "nE": 850,
      "po": 851,
      "so": 852,
      "spec": 853,
      "v_": 854,
      "zation": 855,
      "z_block_size": 856,
      "arit": 857,
      "][(-": 858,
      "refe": 859,
      "vars": 860,
      "length": 861,
      "onal": 862,
      "10000": 863,
      "number": 864,
      "dir": 865,
      "995": 866,
      "num_vars": 867,
      "value": 868,
      "ilarit": 869,
      "can": 870,
      "max_": 871,
      "used": 872,
      "pha": 873,
      "typedef": 874,
      "Start": 875,
      "firstprivate": 876,
      "real8": 877,
      "Variable": 878,
      "reference": 879,
      "ilarity": 880,
      "\"[": 881,
      "\"\"))": 882,
      "(!": 883,
      "-%": 884,
      "2d": 885,
      "3_": 886,
      "3mm": 887,
      "525": 888,
      "533": 889,
      "911": 890,
      "Ar": 891,
      "All": 892,
      "CE": 893,
      "Can": 894,
      "Di": 895,
      "DCE": 896,
      "LL": 897,
      "Ma": 898,
      "Must": 899,
      "NU": 900,
      "Pr": 901,
      "Pos": 902,
      "Ret": 903,
      "Run": 904,
      "Sto": 905,
      "_set": 906,
      "_count": 907,
      "_dir": 908,
      "ace": 909,
      "bench": 910,
      "b_dir": 911,
      "cle": 912,
      "cmp": 913,
      "ding": 914,
      "eve": 915,
      "go": 916,
      "gr": 917,
      "ise": 918,
      "m_": 919,
      "mon": 920,
      "must": 921,
      "ncon": 922,
      "ole": 923,
      "pi": 924,
      "pcounter": 925,
      "rk": 926,
      "smatchScore": 927,
      "scan": 928,
      "tra": 929,
      "using": 930,
      "vent": 931,
      "inclu": 932,
      "ination": 933,
      "may": 934,
      "mark": 935,
      "pre": 936,
      "blem": 937,
      "dead": 938,
      "sid": 939,
      "resid": 940,
      "also": 941,
      "alpha": 942,
      "similarity": 943,
      "--){": 944,
      "tire": 945,
      "ific": 946,
      "printed": 947,
      "entire": 948,
      "(\"\\": 949,
      "omp_set": 950,
      "rix": 951,
      "rieve": 952,
      "adi": 953,
      "/*--------------------------------": 954,
      "ines": 955,
      "],\"\"))": 956,
      "raise": 957,
      "digo": 958,
      "endscop": 959,
      "sub_dir": 960,
      "unsign": 961,
      "elim": 962,
      "bug": 963,
      "num_blocks": 964,
      "strcmp": 965,
      "2025": 966,
      "section_count": 967,
      "add_M": 968,
      "time": 969,
      "timed": 970,
      "problem": 971,
      "allocation": 972,
      "The": 973,
      "This": 974,
      "cause": 975,
      "maxPos": 976,
      "tialization": 977,
      "nowait": 978,
      "whole": 979,
      "initialization": 980,
      ",\"%": 981,
      "Indigo": 982,
      "------------------------------------": 983,
      "declaration": 984,
      "polybench_timer_print": 985,
      "polybench_timer_start": 986,
      "polybench_timer_stop": 987,
      "lap": 988,
      "felen": 989,
      "42000": 990,
      "imper": 991,
      "safelen": 992,
      "diagonal": 993,
      "incr_b": 994,
      "numNodes2": 995,
      "computational": 996,
      "Default": 997,
      "Prevent": 998,
      "common": 999,
      "lower": 1000,
      "specific": 1001,
      "max_num_blocks": 1002,
      "Array": 1003,
      "Main": 1004,
      "NULL": 1005,
      "Retrieve": 1006,
      "Stop": 1007,
      "benchmark": 1008,
      "clean": 1009,
      "ncons": 1010,
      "including": 1011,
      "/*--------------------------------------------------------------------": 1012,
      "unsigned": 1013,
      "elimination": 1014,
      "add_Mult": 1015,
      "Indigo3_": 1016,
      "\")": 1017,
      "119": 1018,
      "1197": 1019,
      "599": 1020,
      "529": 1021,
      "549": 1022,
      "583": 1023,
      "581": 1024,
      "629": 1025,
      "625": 1026,
      "661": 1027,
      "627": 1028,
      "75": 1029,
      "85": 1030,
      "865": 1031,
      "863": 1032,
      "889": 1033,
      "861": 1034,
      "867": 1035,
      "869": 1036,
      "859": 1037,
      "887": 1038,
      "885": 1039,
      "915": 1040,
      "919": 1041,
      "913": 1042,
      "965": 1043,
      "963": 1044,
      "989": 1045,
      "921": 1046,
      "967": 1047,
      "969": 1048,
      "971": 1049,
      "937": 1050,
      "939": 1051,
      "917": 1052,
      "973": 1053,
      "::": 1054,
      "AN": 1055,
      "AX": 1056,
      "Cal": 1057,
      "Con": 1058,
      "D_M": 1059,
      "Mis": 1060,
      "Num": 1061,
      "ON": 1062,
      "Re": 1063,
      "Race": 1064,
      "RAN": 1065,
      "Si": 1066,
      "Uni": 1067,
      "ail": 1068,
      "boun": 1069,
      "cu": 1070,
      "col": 1071,
      "eg": 1072,
      "ecu": 1073,
      "ft": 1074,
      "ful": 1075,
      "fail": 1076,
      "gg": 1077,
      "i1": 1078,
      "id": 1079,
      "jb": 1080,
      "kb": 1081,
      "lim": 1082,
      "l_path": 1083,
      "psum": 1084,
      "pfile": 1085,
      "upd": 1086,
      "ver": 1087,
      "vol": 1088,
      "1615": 1089,
      "1619": 1090,
      "1613": 1091,
      "1665": 1092,
      "1649": 1093,
      "1621": 1094,
      "1667": 1095,
      "1669": 1096,
      "1671": 1097,
      "1623": 1098,
      "1639": 1099,
      "1617": 1100,
      "1673": 1101,
      "1675": 1102,
      "iner": 1103,
      "1565": 1104,
      "1563": 1105,
      "1589": 1106,
      "1561": 1107,
      "1567": 1108,
      "1569": 1109,
      "1571": 1110,
      "1535": 1111,
      "1537": 1112,
      "1539": 1113,
      "1587": 1114,
      "left": 1115,
      "inter": 1116,
      "mast": 1117,
      "pred": 1118,
      "restri": 1119,
      "remo": 1120,
      "seg": 1121,
      "1229": 1122,
      "1249": 1123,
      "1255": 1124,
      "1225": 1125,
      "1257": 1126,
      "1227": 1127,
      "1233": 1128,
      "1231": 1129,
      "1223": 1130,
      "1259": 1131,
      "1251": 1132,
      "1253": 1133,
      "stdir": 1134,
      "erate": 1135,
      "1281": 1136,
      "1283": 1137,
      "1929": 1138,
      "1955": 1139,
      "1925": 1140,
      "1957": 1141,
      "1961": 1142,
      "1927": 1143,
      "1933": 1144,
      "1931": 1145,
      "1935": 1146,
      "1959": 1147,
      "1951": 1148,
      "1953": 1149,
      "1329": 1150,
      "1327": 1151,
      "1333": 1152,
      "1331": 1153,
      "1311": 1154,
      "1335": 1155,
      "1337": 1156,
      "991": 1157,
      "993": 1158,
      "997": 1159,
      "buted": 1160,
      "2011": 1161,
      "651": 1162,
      "653": 1163,
      "655": 1164,
      "657": 1165,
      "659": 1166,
      "180": 1167,
      "1899": 1168,
      "1883": 1169,
      "1881": 1170,
      "contri": 1171,
      "551": 1172,
      "553": 1173,
      "555": 1174,
      "557": 1175,
      "progr": 1176,
      "based": 1177,
      "631": 1178,
      "633": 1179,
      "635": 1180,
      "2003": 1181,
      "2005": 1182,
      "2007": 1183,
      "2009": 1184,
      "573": 1185,
      "575": 1186,
      "577": 1187,
      "579": 1188,
      "891": 1189,
      "893": 1190,
      "895": 1191,
      "601": 1192,
      "603": 1193,
      "605": 1194,
      "607": 1195,
      "609": 1196,
      "1275": 1197,
      "1277": 1198,
      "1279": 1199,
      "1901": 1200,
      "1903": 1201,
      "1905": 1202,
      "1907": 1203,
      "1909": 1204,
      "1301": 1205,
      "1303": 1206,
      "1305": 1207,
      "1307": 1208,
      "1309": 1209,
      "calc": 1210,
      "calcul": 1211,
      "initial": 1212,
      "941": 1213,
      "943": 1214,
      "945": 1215,
      "947": 1216,
      "1641": 1217,
      "1643": 1218,
      "1645": 1219,
      "1647": 1220,
      "1591": 1221,
      "1593": 1222,
      "1595": 1223,
      "1597": 1224,
      "1201": 1225,
      "1203": 1226,
      "1205": 1227,
      "1207": 1228,
      "1981": 1229,
      "1983": 1230,
      "1985": 1231,
      "1987": 1232,
      "1873": 1233,
      "1875": 1234,
      "1877": 1235,
      "1879": 1236,
      "thread_lim": 1237,
      "races": 1238,
      "1541": 1239,
      "1543": 1240,
      "1545": 1241,
      "1977": 1242,
      "1979": 1243,
      "tokenizers": 1244,
      "import": 1245,
      "consumed": 1246,
      "newSxx": 1247,
      "newSyy": 1248,
      "generate": 1249,
      "produced": 1250,
      "547": 1251,
      "listdir": 1252,
      "Diag": 1253,
      "Pro": 1254,
      "lapse": 1255,
      "1199": 1256,
      "Calcul": 1257,
      "D_MAX": 1258,
      "Number": 1259,
      "RAND_MAX": 1260,
      "Univ": 1261,
      "bound": 1262,
      "collapse": 1263,
      "full_path": 1264,
      "update": 1265,
      "master": 1266,
      "restrict": 1267,
      "contributed": 1268,
      "program": 1269,
      "calculation": 1270,
      "thread_limit": 1271,
      "\"+": 1272,
      "(%": 1273,
      ")]": 1274,
      "/\"+": 1275,
      "149": 1276,
      "24": 1277,
      "527": 1278,
      "531": 1279,
      "523": 1280,
      "<<": 1281,
      "Ab": 1282,
      "Bool": 1283,
      "Ch": 1284,
      "GA": 1285,
      "Get": 1286,
      "Mult": 1287,
      "TT": 1288,
      "Ta": 1289,
      "Write": 1290,
      "]@": 1291,
      "]\",": 1292,
      "_w": 1293,
      "_task": 1294,
      "_2d": 1295,
      "_imper": 1296,
      "_Bool": 1297,
      "ai": 1298,
      "aj": 1299,
      "cer": 1300,
      "ev": 1301,
      "ha": 1302,
      "ice": 1303,
      "j2": 1304,
      "jo": 1305,
      "k2": 1306,
      "mv": 1307,
      "nt": 1308,
      "o1": 1309,
      "py": 1310,
      "pen": 1311,
      "qq": 1312,
      "rd": 1313,
      "sz": 1314,
      "tou": 1315,
      "up": 1316,
      "war": 1317,
      "x1": 1318,
      "x10": 1319,
      "xpy": 1320,
      "{}": 1321,
      "ori": 1322,
      "-((-": 1323,
      "++,": 1324,
      "?(((": 1325,
      "aling": 1326,
      "variable": 1327,
      "().": 1328,
      "()==": 1329,
      "(((((((((": 1330,
      "))?(((((((": 1331,
      "thrd": 1332,
      "dire": 1333,
      "outLen": 1334,
      "992": 1335,
      "num_sz": 1336,
      "1048": 1337,
      "uling": 1338,
      "val_w": 1339,
      "coef": 1340,
      "const": 1341,
      "allocate": 1342,
      "]!=-": 1343,
      "tmp1": 1344,
      "barrier_init": 1345,
      "barrier_destroy": 1346,
      "barrier_start": 1347,
      "barrier_stop": 1348,
      "execu": 1349,
      "ments": 1350,
      "matrix": 1351,
      "scheduling": 1352,
      "matchMis": 1353,
      "...\\": 1354,
      "kernel_jacobi": 1355,
      "kernel_3mm": 1356,
      "kernel_adi": 1357,
      "elements": 1358,
      "saxpy": 1359,
      "consume": 1360,
      "signaling": 1361,
      "incr_a": 1362,
      "gen_task": 1363,
      "trigg": 1364,
      "write_path": 1365,
      "orting": 1366,
      "missing": 1367,
      "nEle": 1368,
      "v_out": 1369,
      "values": 1370,
      "Consum": 1371,
      "idth": 1372,
      "interval_w": 1373,
      "remove": 1374,
      "segments": 1375,
      "Produ": 1376,
      "1492": 1377,
      "Aborting": 1378,
      "Child": 1379,
      "Task": 1380,
      "Write_set": 1381,
      "_2d_imper": 1382,
      "even": 1383,
      "join": 1384,
      "touched": 1385,
      "x1024": 1386,
      "execution": 1387,
      "matchMissmatchScore": 1388,
      "kernel_jacobi_2d_imper": 1389,
      "trigger": 1390,
      "interval_width": 1391,
      ")][": 1392,
      "2000": 1393,
      "40": 1394,
      "70": 1395,
      "Alloc": 1396,
      "Ex": 1397,
      "Element": 1398,
      "Fib": 1399,
      "Function": 1400,
      "Gu": 1401,
      "Gen": 1402,
      "NON": 1403,
      "PI": 1404,
      "Pu": 1405,
      "Rice": 1406,
      "To": 1407,
      "Yi": 1408,
      "[]": 1409,
      "]-=": 1410,
      "_c": 1411,
      "ab": 1412,
      "ac": 1413,
      "ax": 1414,
      "ay": 1415,
      "ause": 1416,
      "cil": 1417,
      "due": 1418,
      "fine": 1419,
      "gin": 1420,
      "gap": 1421,
      "ip": 1422,
      "j1": 1423,
      "k1": 1424,
      "ld": 1425,
      "lines": 1426,
      "my": 1427,
      "nvol": 1428,
      "nDiag": 1429,
      "ops": 1430,
      "per": 1431,
      "q_c": 1432,
      "r1": 1433,
      "rce": 1434,
      "rpo": 1435,
      "sou": 1436,
      "spa": 1437,
      "tx": 1438,
      "tter": 1439,
      "tol": 1440,
      "ures": 1441,
      "vel": 1442,
      "we": 1443,
      "wo": 1444,
      "wor": 1445,
      "zi": 1446,
      "insert": 1447,
      "letter": 1448,
      "level": 1449,
      "omeg": 1450,
      "ould": 1451,
      "dela": 1452,
      "sten": 1453,
      "sition": 1454,
      "ret": 1455,
      "refine": 1456,
      "0000": 1457,
      "clause": 1458,
      "seq_c": 1459,
      "parent": 1460,
      "teration": 1461,
      "skip": 1462,
      "set_nest_lock": 1463,
      "dition": 1464,
      "should": 1465,
      "ass": 1466,
      "num_steps": 1467,
      "omp_unset_nest_lock": 1468,
      "tempfile": 1469,
      "256": 1470,
      "nobug": 1471,
      "omp_get_num_threads": 1472,
      "pairs": 1473,
      "copy": 1474,
      "new_": 1475,
      "pdv_": 1476,
      "append": 1477,
      "nElement": 1478,
      "position": 1479,
      "m_nvol": 1480,
      "m_pdv_": 1481,
      "trainer": 1482,
      "prede": 1483,
      "similarityScore": 1484,
      "omp_set_": 1485,
      "omp_set_nest_lock": 1486,
      "Indigo3_bug": 1487,
      "Indigo3_nobug": 1488,
      "\"):": 1489,
      "failures": 1490,
      "Calculate": 1491,
      "origin": 1492,
      "Allocates": 1493,
      "NONE": 1494,
      "Purpo": 1495,
      "Yizi": 1496,
      "cil_": 1497,
      "gapScore": 1498,
      "mytempfile": 1499,
      "source": 1500,
      "space": 1501,
      "txt": 1502,
      "work": 1503,
      "omega": 1504,
      "delay": 1505,
      "stencil_": 1506,
      "seq_cst": 1507,
      "m_pdv_sum": 1508,
      "original": 1509,
      "Purpose": 1510,
      "\"/\"+": 1511,
      "',": 1512,
      "'←": 1513,
      "'↑": 1514,
      "())": 1515,
      "):": 1516,
      ")=%": 1517,
      ")++;": 1518,
      ")][-": 1519,
      "*));": 1520,
      "**)": 1521,
      "+\"/\"+": 1522,
      "0f": 1523,
      "054": 1524,
      "4000": 1525,
      "56": 1526,
      "62": 1527,
      "66": 1528,
      "923": 1529,
      ":%": 1530,
      ">-": 1531,
      "?-((-": 1532,
      "AG": 1533,
      "AL": 1534,
      "ATT": 1535,
      "BP": 1536,
      "BU": 1537,
      "Bpe": 1538,
      "CA": 1539,
      "CTT": 1540,
      "DE": 1541,
      "DI": 1542,
      "De": 1543,
      "Del": 1544,
      "FT": 1545,
      "First": 1546,
      "HS": 1547,
      "Hel": 1548,
      "M_": 1549,
      "Mat": 1550,
      "NK": 1551,
      "PA": 1552,
      "RHS": 1553,
      "Ste": 1554,
      "Sum": 1555,
      "TH": 1556,
      "Tra": 1557,
      "Two": 1558,
      "UP": 1559,
      "UNK": 1560,
      "Wh": 1561,
      "Wu": 1562,
      "Wen": 1563,
      "[],": 1564,
      "]<=": 1565,
      "]};": 1566,
      "_to": 1567,
      "_no": 1568,
      "_from": 1569,
      "_input": 1570,
      "_code": 1571,
      "_com": 1572,
      "af": 1573,
      "ack": 1574,
      "ach": 1575,
      "ang": 1576,
      "access": 1577,
      "awar": 1578,
      "bal": 1579,
      "bet": 1580,
      "back": 1581,
      "cf": 1582,
      "ci": 1583,
      "car": 1584,
      "cti": 1585,
      "calloc": 1586,
      "cted": 1587,
      "dri": 1588,
      "es": 1589,
      "est": 1590,
      "fn": 1591,
      "gea": 1592,
      "ite": 1593,
      "ire": 1594,
      "iteration": 1595,
      "ken": 1596,
      "ly": 1597,
      "line": 1598,
      "mu": 1599,
      "men": 1600,
      "mer": 1601,
      "mit": 1602,
      "ning": 1603,
      "none": 1604,
      "o8": 1605,
      "ost": 1606,
      "over": 1607,
      "pass": 1608,
      "qu": 1609,
      "sy": 1610,
      "sin": 1611,
      "som": 1612,
      "sam": 1613,
      "score": 1614,
      "srand": 1615,
      "x1000": 1616,
      "xinout": 1617,
      "{&": 1618,
      "{};": 1619,
      ")):": 1620,
      "orage": 1621,
      "++]": 1622,
      "?(((((": 1623,
      "?((((((": 1624,
      "deallocate": 1625,
      "stprivate": 1626,
      "storage": 1627,
      "tected": 1628,
      "texinout": 1629,
      "reas": 1630,
      "rela": 1631,
      "allow": 1632,
      "load": 1633,
      "loops": 1634,
      "lobal": 1635,
      "setu": 1636,
      "seed": 1637,
      "sent": 1638,
      "((((((((": 1639,
      "chang": 1640,
      "1001": 1641,
      "omp_nest_lock": 1642,
      "]==": 1643,
      "erates": 1644,
      "ad_set": 1645,
      "taskloop": 1646,
      "===": 1647,
      "ced": 1648,
      "dimen": 1649,
      "readlines": 1650,
      "num_refine": 1651,
      "there": 1652,
      "10x1024": 1653,
      "dataset": 1654,
      "))))?(((": 1655,
      "checking": 1656,
      "2048": 1657,
      "20x1000": 1658,
      "fopen": 1659,
      "foo1": 1660,
      "stant": 1661,
      "497": 1662,
      "condition": 1663,
      "omp_init_nest_lock": 1664,
      "omp_destroy_nest_lock": 1665,
      "maxim": 1666,
      "cessor": 1667,
      "now": 1668,
      "exit": 1669,
      "open": 1670,
      "file_path": 1671,
      "phen": 1672,
      "zeros": 1673,
      "eful": 1674,
      "Note": 1675,
      "lastprivate": 1676,
      "...": 1677,
      "LEFT": 1678,
      "consumer": 1679,
      "producer": 1680,
      "Because": 1681,
      "mmm": 1682,
      "within": 1683,
      "Defines": 1684,
      "Present": 1685,
      "lld": 1686,
      "corpus_no": 1687,
      "missmatchScore": 1688,
      "track": 1689,
      "pre_": 1690,
      "ONAL": 1691,
      "Real": 1692,
      "Read_set": 1693,
      "Size": 1694,
      "Sieg": 1695,
      "fails": 1696,
      "volnew_": 1697,
      "calcFirst": 1698,
      "DiagElement": 1699,
      "Calculates": 1700,
      "bounds": 1701,
      "GAATT": 1702,
      "GACTT": 1703,
      "hao": 1704,
      "have": 1705,
      "warning": 1706,
      "variables": 1707,
      "direction": 1708,
      "directi": 1709,
      "coeff": 1710,
      "Consumer": 1711,
      "Consumed": 1712,
      "Producer": 1713,
      "Produced": 1714,
      "Expected": 1715,
      "Generates": 1716,
      "Tokenizer": 1717,
      "about": 1718,
      "acqu": 1719,
      "pers": 1720,
      "copyin": 1721,
      "predecessor": 1722,
      "source_code": 1723,
      "stencil_calc": 1724,
      "'←'": 1725,
      "'↑'": 1726,
      "0543": 1727,
      "AGONAL": 1728,
      "BPE": 1729,
      "BUG": 1730,
      "BpeTra": 1731,
      "DEBUG": 1732,
      "DIAGONAL": 1733,
      "Delawar": 1734,
      "Helpers": 1735,
      "M_PI": 1736,
      "Matrix": 1737,
      "Stephen": 1738,
      "White": 1739,
      "Wenhao": 1740,
      "_token": 1741,
      "_from_input": 1742,
      "_comment": 1743,
      "after": 1744,
      "backtrack": 1745,
      "careful": 1746,
      "driver": 1747,
      "geable": 1748,
      "linear": 1749,
      "mutexinout": 1750,
      "mergeable": 1751,
      "mits": 1752,
      "sink": 1753,
      "some": 1754,
      "same": 1755,
      "reasing": 1756,
      "relax": 1757,
      "load_from_input": 1758,
      "setup": 1759,
      "change": 1760,
      "omp_nest_lock_t": 1761,
      "dimensi": 1762,
      "10x1024x1024": 1763,
      "stants": 1764,
      "maximum": 1765,
      "corpus_no_comment": 1766,
      "Siegel": 1767,
      "volnew_o8": 1768,
      "calcFirstDiagElement": 1769,
      "GAATTCA": 1770,
      "directive": 1771,
      "acquire": 1772,
      "BpeTrainer": 1773,
      "Delaware": 1774,
      "Whitespace": 1775,
      "mutexinoutset": 1776,
      "\"%": 1777,
      "\"])": 1778,
      "\"<<": 1779,
      "')": 1780,
      ")(": 1781,
      ")-": 1782,
      ")\\": 1783,
      "+\");": 1784,
      "/(": 1785,
      "/((": 1786,
      "05": 1787,
      "26": 1788,
      "28": 1789,
      "30": 1790,
      "34": 1791,
      "96": 1792,
      "97": 1793,
      ";}": 1794,
      "=[": 1795,
      "=\"[": 1796,
      "AS": 1797,
      "Al": 1798,
      "An": 1799,
      "Aach": 1800,
      "CL": 1801,
      "CP": 1802,
      "Cl": 1803,
      "Cen": 1804,
      "Col": 1805,
      "Cop": 1806,
      "EP": 1807,
      "FI": 1808,
      "Global": 1809,
      "Iteration": 1810,
      "Jo": 1811,
      "Lo": 1812,
      "Lines": 1813,
      "MAS": 1814,
      "RW": 1815,
      "Rand": 1816,
      "Ref": 1817,
      "Str": 1818,
      "Sim": 1819,
      "SEP": 1820,
      "Tim": 1821,
      "Test": 1822,
      "Upd": 1823,
      "We": 1824,
      "With": 1825,
      "[*": 1826,
      "]\\": 1827,
      "]\"))": 1828,
      "]\"])": 1829,
      "_s": 1830,
      "_device": 1831,
      "_li": 1832,
      "_initial": 1833,
      "bl": 1834,
      "bs": 1835,
      "bta": 1836,
      "ctu": 1837,
      "cout": 1838,
      "cassert": 1839,
      "carri": 1840,
      "creasing": 1841,
      "dat": 1842,
      "esh": 1843,
      "erence": 1844,
      "fcl": 1845,
      "fault": 1846,
      "gma": 1847,
      "gni": 1848,
      "gone": 1849,
      "global": 1850,
      "has": 1851,
      "hap": 1852,
      "host": 1853,
      "ial": 1854,
      "ich": 1855,
      "ient": 1856,
      "ista": 1857,
      "iost": 1858,
      "js": 1859,
      "ls": 1860,
      "mine": 1861,
      "mul": 1862,
      "mem": 1863,
      "mesh": 1864,
      "mista": 1865,
      "nc": 1866,
      "ns": 1867,
      "nMatrix": 1868,
      "ose": 1869,
      "oca": 1870,
      "ove": 1871,
      "oops": 1872,
      "obta": 1873,
      "ple": 1874,
      "ping": 1875,
      "pat": 1876,
      "qr": 1877,
      "que": 1878,
      "ron": 1879,
      "sb": 1880,
      "sf": 1881,
      "sm": 1882,
      "sw": 1883,
      "sol": 1884,
      "smatch": 1885,
      "sqr": 1886,
      "tw": 1887,
      "tal": 1888,
      "tze": 1889,
      "two": 1890,
      "unk": 1891,
      "ution": 1892,
      "user": 1893,
      "ved": 1894,
      "ving": 1895,
      "voca": 1896,
      "wtime": 1897,
      "wron": 1898,
      "inste": 1899,
      "1500": 1900,
      "orted": 1901,
      "ores": 1902,
      "lete": 1903,
      "into": 1904,
      "matic": 1905,
      "make": 1906,
      "oup": 1907,
      "arace": 1908,
      "][%": 1909,
      "deri": 1910,
      "dence": 1911,
      "depen": 1912,
      "decreasing": 1913,
      "dels": 1914,
      "delete": 1915,
      "sted": 1916,
      "tern": 1917,
      "tection": 1918,
      "sic": 1919,
      "sidu": 1920,
      "ream": 1921,
      "reco": 1922,
      "reque": 1923,
      "00L": 1924,
      "00000": 1925,
      "alread": 1926,
      "class": 1927,
      "simul": 1928,
      "tiple": 1929,
      "ify": 1930,
      "ifdef": 1931,
      "stdint": 1932,
      "returns": 1933,
      "()%": 1934,
      "()\\": 1935,
      "umns": 1936,
      "ensu": 1937,
      "onac": 1938,
      "\",\"": 1939,
      "termin": 1940,
      "termine": 1941,
      "omp_is": 1942,
      "]=(": 1943,
      "zed": 1944,
      "this": 1945,
      "])/": 1946,
      "addition": 1947,
      "taskgr": 1948,
      "location": 1949,
      "endl": 1950,
      "endif": 1951,
      "ings": 1952,
      "sugg": 1953,
      "unable": 1954,
      "but": 1955,
      "busy": 1956,
      "asso": 1957,
      "assic": 1958,
      "serve": 1959,
      "serts": 1960,
      "tomatic": 1961,
      "2015": 1962,
      "2040": 1963,
      "arrays": 1964,
      "_tol": 1965,
      "tral": 1966,
      "isfile": 1967,
      "add_s": 1968,
      "valid": 1969,
      "stable": 1970,
      "stack": 1971,
      "constants": 1972,
      "publ": 1973,
      "proc": 1974,
      "proper": 1975,
      "protected": 1976,
      "protection": 1977,
      "icient": 1978,
      "2560": 1979,
      "ones": 1980,
      "because": 1981,
      "causing": 1982,
      "ctori": 1983,
      "node": 1984,
      "error_tol": 1985,
      "indexing": 1986,
      "which": 1987,
      "oper": 1988,
      "**));": 1989,
      "***)": 1990,
      "****": 1991,
      "***));": 1992,
      "****)": 1993,
      "get_voca": 1994,
      "Inserts": 1995,
      "vectori": 1996,
      "omp_get_max_": 1997,
      "omp_get_wtime": 1998,
      "]*(": 1999,
      "]*=": 2000,
      "each": 2001,
      "labs": 2002,
      "results": 2003,
      "answ": 2004,
      "nested": 2005,
      "517": 2006,
      "51200L": 2007,
      "Initial": 2008,
      "structu": 2009,
      "832040": 2010,
      "save": 2011,
      "increasing": 2012,
      "compared": 2013,
      "rectly": 2014,
      "strings": 2015,
      "namespace": 2016,
      "automatic": 2017,
      "200000000": 2018,
      "Stores": 2019,
      "like": 2020,
      "move": 2021,
      "models": 2022,
      "missmatch": 2023,
      "pointer": 2024,
      "special": 2025,
      "phabet": 2026,
      "Variables": 2027,
      "Directly": 2028,
      "Proper": 2029,
      "train": 2030,
      "preserve": 2031,
      "alphabet": 2032,
      "lapping": 2033,
      "Constants": 2034,
      "Missing": 2035,
      "Residu": 2036,
      "Sigma": 2037,
      "ecuted": 2038,
      "verify": 2039,
      "removing": 2040,
      "calcElement": 2041,
      "initialTim": 2042,
      "Protze": 2043,
      "<<\"": 2044,
      "Gets": 2045,
      "pens": 2046,
      "matrixes": 2047,
      "4096": 2048,
      "Executed": 2049,
      "Fibonac": 2050,
      "Total": 2051,
      "[]:": 2052,
      "above": 2053,
      "000000000": 2054,
      "copyprivate": 2055,
      "new_proc": 2056,
      "trainers": 2057,
      "predetermin": 2058,
      "omp_set_num_threads": 2059,
      "omp_set_dynamic": 2060,
      "omp_set_nested": 2061,
      "stencil_in": 2062,
      "())/((": 2063,
      "Detected": 2064,
      "Determine": 2065,
      "PAD": 2066,
      "PATH": 2067,
      "achim": 2068,
      "ciate": 2069,
      "ested": 2070,
      "overlapping": 2071,
      "sync": 2072,
      "scores": 2073,
      "allows": 2074,
      "pre_tokenizer": 2075,
      "pre_tokenizers": 2076,
      "coefficient": 2077,
      "_tokens": 2078,
      "dimension": 2079,
      "dimensional": 2080,
      "=[\"[": 2081,
      "Alphabet": 2082,
      "Any": 2083,
      "Aachen": 2084,
      "CLS": 2085,
      "CPU": 2086,
      "Classic": 2087,
      "Central": 2088,
      "Columns": 2089,
      "Copy": 2090,
      "FILE": 2091,
      "Iterations": 2092,
      "Joachim": 2093,
      "Loop": 2094,
      "MASK": 2095,
      "RWTH": 2096,
      "Random": 2097,
      "Reference": 2098,
      "Strings": 2099,
      "Similarity": 2100,
      "Updates": 2101,
      "Without": 2102,
      "_list": 2103,
      "_initial_device": 2104,
      "carried": 2105,
      "datarace": 2106,
      "fclose": 2107,
      "gnized": 2108,
      "happens": 2109,
      "iostream": 2110,
      "json": 2111,
      "multiple": 2112,
      "memset": 2113,
      "mistake": 2114,
      "obtain": 2115,
      "pattern": 2116,
      "solution": 2117,
      "sqrt": 2118,
      "twice": 2119,
      "unk_token": 2120,
      "wrong": 2121,
      "instead": 2122,
      "orted_list": 2123,
      "makes": 2124,
      "derived": 2125,
      "dependence": 2126,
      "recognized": 2127,
      "requested": 2128,
      "already": 2129,
      "simulate": 2130,
      "ensure": 2131,
      "omp_is_initial_device": 2132,
      "taskgroup": 2133,
      "suggested": 2134,
      "associate": 2135,
      "add_sorted_list": 2136,
      "public": 2137,
      "properly": 2138,
      "get_vocab": 2139,
      "vectorization": 2140,
      "omp_get_max_threads": 2141,
      "answer": 2142,
      "structure": 2143,
      "pointers": 2144,
      "special_tokens": 2145,
      "Residual": 2146,
      "initialTime": 2147,
      "Fibonacci": 2148,
      "0000000001": 2149,
      "predetermined": 2150,
      "coefficients": 2151,
      "References": 2152
    },
    "merges": [
      "1 6",
      "( (",
      ") )",
      "i n",
      "c 2",
      "n j",
      "c 4",
      "- (",
      "n k",
      "1 5",
      "c 3",
      "o r",
      "- ((",
      "-(( -(",
      "l e",
      "in t",
      "f or",
      "c 1",
      "n l",
      "m a",
      "n m",
      "p r",
      "o m",
      "+ +",
      "om p",
      "? ((",
      "++ )",
      "o u",
      "a r",
      "a g",
      "] [",
      "pr ag",
      "prag ma",
      "< =",
      "n i",
      ")) )",
      "b le",
      "d ou",
      "d e",
      "dou ble",
      ") ;",
      ")) ;",
      "? -((-(",
      "s t",
      "(( (",
      "t e",
      "s i",
      "r e",
      "0 0",
      "a l",
      "c l",
      "cl u",
      "clu de",
      "l o",
      "in clude",
      "si m",
      "sim d",
      "c k",
      "- -",
      "s e",
      "t i",
      "i f",
      "r n",
      "st d",
      "t u",
      "re tu",
      "retu rn",
      "1 2",
      ")) ))",
      "v ar",
      "( -",
      "( )",
      "? -(",
      "lo ck",
      "ar g",
      "p ar",
      "le l",
      "al lel",
      "par allel",
      "ou n",
      "? (-",
      "?-( -",
      "c oun",
      "pr int",
      "le n",
      "u m",
      "(( ((",
      "e n",
      "c h",
      "print f",
      "] ;",
      "ma in",
      "o n",
      "( \"",
      "std i",
      "stdi o",
      "\" ,",
      "t a",
      "1 00",
      "te r",
      "coun ter",
      "omp _",
      "] =",
      "r i",
      ")) ?((",
      "-- --",
      "e r",
      "i t",
      "() {",
      "/ /",
      "o f",
      "( &",
      "z e",
      "t h",
      "++) {",
      "counter var",
      "12 8",
      "] )",
      "_ lock",
      "))?(( (",
      "a d",
      "s k",
      "( );",
      "si ze",
      "a te",
      "ta sk",
      "s um",
      "5 00",
      "> =",
      "o l",
      "= =",
      "c 0",
      "c e",
      "o i",
      "ti on",
      "* /",
      "/ *",
      "1 9",
      "i v",
      "de f",
      "& &",
      "e t",
      "e d",
      "pr iv",
      "priv ate",
      "in e",
      ")) )))",
      "se t",
      "] ,",
      "v oi",
      "voi d",
      "a m",
      "in it",
      "n um",
      "arg c",
      "arg v",
      "def ine",
      "i b",
      "r a",
      "lo c",
      "] );",
      "---- ----",
      "(( (((",
      "c 8",
      "set _lock",
      "d i",
      "en d",
      "re ad",
      "ti d",
      "b lock",
      "m p",
      "p s",
      "= %",
      "st e",
      "ste ps",
      "c tion",
      "s h",
      "v i",
      "in g",
      "s u",
      "t arg",
      "targ et",
      "1 3",
      ")) ));",
      "ma p",
      "ou t",
      "c 5",
      "te am",
      "team s",
      "l ib",
      "u n",
      "ti c",
      "std lib",
      "ch ar",
      "++ ;",
      "e l",
      "y b",
      "9 9",
      "r om",
      "t steps",
      "coun t",
      "b u",
      "te st",
      "en ch",
      "a s",
      "p end",
      "* )",
      "size of",
      "de pend",
      "num _",
      "a ta",
      "p ol",
      "st ri",
      "th read",
      "yb ench",
      "bu te",
      "pol ybench",
      "a t",
      "c 15",
      "se r",
      "ar ed",
      "[ ])",
      "f re",
      "th e",
      "sh ared",
      "ser t",
      "fre e",
      "+ =",
      "1 0",
      "de vi",
      "st r",
      "devi ce",
      "di stri",
      "distri bute",
      "\" );",
      "a it",
      "p a",
      "t of",
      "w ait",
      "tof rom",
      "t o",
      "as sert",
      "n d",
      "u e",
      "ra y",
      "u l",
      "))))) ;",
      "d ata",
      ")))) ?((",
      "e ck",
      "ar ri",
      "ch eck",
      "2 0",
      "l loc",
      "]= %",
      "arri er",
      "ar ray",
      "c 9",
      "o ol",
      "ma lloc",
      "3 2",
      "f o",
      "omp_ un",
      "2 9",
      "_ t",
      "t r",
      "i s",
      "se ction",
      "100 0",
      "fo o",
      "6 5",
      "b ool",
      "f al",
      "n g",
      "omp_ set_lock",
      "omp_un set_lock",
      "tr ue",
      "fal se",
      "s ing",
      "ad d",
      "c ri",
      "lo ng",
      "tic al",
      "cri tical",
      ") {",
      "b arrier",
      "v al",
      "p e",
      "(\" %",
      "task wait",
      "! =",
      "a se",
      "c 7",
      "c o",
      "c1 0",
      "00 0",
      "ti m",
      "-------- --------",
      "polybench _",
      "5 0",
      "k e",
      "en t",
      "1 8",
      "i l",
      "x a",
      "4 8",
      "st a",
      "te mp",
      "))?(( (((",
      "4 9",
      "] +",
      "c on",
      "p u",
      "de r",
      "su block",
      "el se",
      "add lock",
      "5 5",
      "i le",
      "pr o",
      "al loc",
      "[ -",
      "] !=",
      "i c",
      "n e",
      "s s",
      "sing le",
      "a tion",
      "b ase",
      "c or",
      "d u",
      "l ck",
      "o y",
      "r or",
      "t mp",
      "de str",
      "ul t",
      "destr oy",
      "6 4",
      "ti al",
      "sta tic",
      "- >",
      "6 3",
      "l 0",
      "l 1",
      "( *",
      "2 5",
      "2 00",
      "(((( (((",
      "5 7",
      "8 9",
      "(((( ((",
      "on e",
      "100 000",
      "omp_ init",
      "omp_ destroy",
      "tim er",
      "T h",
      "?(( ((",
      "))) ;",
      "thread s",
      "b e",
      "f l",
      "][ -",
      "sum 1",
      "pe c",
      "pu t",
      "omp_init _lock",
      "omp_destroy _lock",
      "c a",
      "c t",
      "d x",
