{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "_": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "}": 91,
      "←": 92,
      "↑": 93,
      "↖": 94,
      "16": 95,
      "((": 96,
      "))": 97,
      "in": 98,
      "c2": 99,
      "nj": 100,
      "c4": 101,
      "-(": 102,
      "nk": 103,
      "15": 104,
      "c3": 105,
      "-((": 106,
      "-((-(": 107,
      "or": 108,
      "le": 109,
      "c1": 110,
      "nl": 111,
      "nm": 112,
      "for": 113,
      "int": 114,
      "pr": 115,
      "ma": 116,
      "om": 117,
      "++": 118,
      "omp": 119,
      "?((": 120,
      "++)": 121,
      "ou": 122,
      "ar": 123,
      "ag": 124,
      "prag": 125,
      "pragma": 126,
      "][": 127,
      "<=": 128,
      "ni": 129,
      ")))": 130,
      "ble": 131,
      "dou": 132,
      ");": 133,
      "double": 134,
      "de": 135,
      "));": 136,
      "?-((-(": 137,
      "(((": 138,
      "st": 139,
      "te": 140,
      "si": 141,
      "re": 142,
      "al": 143,
      "00": 144,
      "cl": 145,
      "clu": 146,
      "lo": 147,
      "clude": 148,
      "include": 149,
      "sim": 150,
      "simd": 151,
      "ck": 152,
      "--": 153,
      "se": 154,
      "ti": 155,
      "if": 156,
      "rn": 157,
      "12": 158,
      "tu": 159,
      "))))": 160,
      "std": 161,
      "retu": 162,
      "return": 163,
      "var": 164,
      "(-": 165,
      "?-(": 166,
      "lock": 167,
      "arg": 168,
      "?(-": 169,
      "?-(-": 170,
      "oun": 171,
      "()": 172,
      "coun": 173,
      "par": 174,
      "print": 175,
      "lel": 176,
      "allel": 177,
      "parallel": 178,
      "((((": 179,
      "len": 180,
      "um": 181,
      "ch": 182,
      "en": 183,
      "printf": 184,
      "on": 185,
      "main": 186,
      "(\"": 187,
      "];": 188,
      "ta": 189,
      "\",": 190,
      "ter": 191,
      "io": 192,
      "stdio": 193,
      "counter": 194,
      "omp_": 195,
      "))?((": 196,
      "ri": 197,
      "----": 198,
      "it": 199,
      "]=": 200,
      "(){": 201,
      "er": 202,
      "(&": 203,
      "//": 204,
      "100": 205,
      "of": 206,
      "ze": 207,
      "++){": 208,
      "countervar": 209,
      "128": 210,
      "_lock": 211,
      "])": 212,
      "))?(((": 213,
      "th": 214,
      "sk": 215,
      "ad": 216,
      "size": 217,
      "task": 218,
      "();": 219,
      "500": 220,
      ">=": 221,
      "c0": 222,
      "==": 223,
      "ate": 224,
      "ol": 225,
      "sum": 226,
      "*/": 227,
      "/*": 228,
      "tion": 229,
      "19": 230,
      "ce": 231,
      "oi": 232,
      "&&": 233,
      "et": 234,
      "iv": 235,
      "def": 236,
      "ed": 237,
      ")))))": 238,
      "set": 239,
      "priv": 240,
      "private": 241,
      "init": 242,
      "ine": 243,
      "num": 244,
      "voi": 245,
      "void": 246,
      "ib": 247,
      "argc": 248,
      "argv": 249,
      "],": 250,
      "am": 251,
      "define": 252,
      "loc": 253,
      "]);": 254,
      "--------": 255,
      "(((((": 256,
      "c8": 257,
      "ra": 258,
      "set_lock": 259,
      "tid": 260,
      "end": 261,
      "block": 262,
      "=%": 263,
      "ps": 264,
      "read": 265,
      "ste": 266,
      "vi": 267,
      "steps": 268,
      "ction": 269,
      "mp": 270,
      "sh": 271,
      "ing": 272,
      "13": 273,
      "di": 274,
      "ue": 275,
      "))));": 276,
      "c5": 277,
      "targ": 278,
      "team": 279,
      "target": 280,
      "teams": 281,
      "lib": 282,
      "un": 283,
      "map": 284,
      "stdlib": 285,
      "tic": 286,
      "++;": 287,
      "el": 288,
      "yb": 289,
      "99": 290,
      "tsteps": 291,
      "out": 292,
      "count": 293,
      "char": 294,
      "ss": 295,
      "test": 296,
      "ench": 297,
      "rom": 298,
      "ute": 299,
      "*)": 300,
      "dep": 301,
      "sizeof": 302,
      "depend": 303,
      "ata": 304,
      "bute": 305,
      "pol": 306,
      "stri": 307,
      "thread": 308,
      "num_": 309,
      "ybench": 310,
      "polybench": 311,
      "as": 312,
      "c15": 313,
      "ser": 314,
      "fre": 315,
      "the": 316,
      "sert": 317,
      "free": 318,
      "10": 319,
      "at": 320,
      "ul": 321,
      "ared": 322,
      "devi": 323,
      "str": 324,
      "device": 325,
      "[])": 326,
      "shared": 327,
      "distri": 328,
      "distribute": 329,
      "\");": 330,
      "ait": 331,
      "tof": 332,
      "wait": 333,
      "tofrom": 334,
      "assert": 335,
      "+=": 336,
      "ray": 337,
      "nd": 338,
      ")))));": 339,
      "data": 340,
      "))))?((": 341,
      "eck": 342,
      "arri": 343,
      "check": 344,
      "20": 345,
      "lloc": 346,
      "]=%": 347,
      "arrier": 348,
      "array": 349,
      "c9": 350,
      "ool": 351,
      "malloc": 352,
      "32": 353,
      "omp_un": 354,
      "29": 355,
      "_t": 356,
      "tr": 357,
      "section": 358,
      "65": 359,
      "bool": 360,
      "fal": 361,
      "ng": 362,
      "omp_set_lock": 363,
      "omp_unset_lock": 364,
      "true": 365,
      "false": 366,
      "add": 367,
      "ult": 368,
      "cri": 369,
      "op": 370,
      "long": 371,
      "tical": 372,
      "critical": 373,
      "){": 374,
      "barrier": 375,
      "pa": 376,
      "val": 377,
      "1000": 378,
      "(\"%": 379,
      "taskwait": 380,
      "!=": 381,
      "ase": 382,
      "c7": 383,
      "c10": 384,
      "000": 385,
      "tim": 386,
      "----------------": 387,
      "polybench_": 388,
      "50": 389,
      "sing": 390,
      "18": 391,
      "il": 392,
      "pe": 393,
      "xa": 394,
      "su": 395,
      "to": 396,
      "ent": 397,
      "48": 398,
      "temp": 399,
      "))?(((((": 400,
      "49": 401,
      "con": 402,
      "oo": 403,
      "der": 404,
      "sta": 405,
      "else": 406,
      "addlock": 407,
      "sublock": 408,
      "55": 409,
      "foo": 410,
      "alloc": 411,
      "[-": 412,
      "]!=": 413,
      "ic": 414,
      "is": 415,
      "pro": 416,
      "single": 417,
      "ation": 418,
      "base": 419,
      "lck": 420,
      "oy": 421,
      "ror": 422,
      "tmp": 423,
      "destr": 424,
      "destroy": 425,
      "64": 426,
      "du": 427,
      "ne": 428,
      "tial": 429,
      "->": 430,
      "63": 431,
      "l0": 432,
      "l1": 433,
      "static": 434,
      "(*": 435,
      "25": 436,
      "(((((((": 437,
      "200": 438,
      "57": 439,
      "89": 440,
      "((((((": 441,
      "omp_init": 442,
      "omp_destroy": 443,
      "100000": 444,
      "timer": 445,
      "Th": 446,
      "pu": 447,
      "?((((": 448,
      ")));": 449,
      "one": 450,
      "threads": 451,
      "be": 452,
      "fl": 453,
      "][-": 454,
      "sum1": 455,
      "omp_init_lock": 456,
      "omp_destroy_lock": 457,
      "put": 458,
      "]+": 459,
      "ct": 460,
      "dx": 461,
      "ke": 462,
      "inout": 463,
      "max": 464,
      "cess": 465,
      "num_threads": 466,
      "pec": 467,
      "tiali": 468,
      "60": 469,
      "ca": 470,
      "cor": 471,
      "fprintf": 472,
      "ir": 473,
      "u1": 474,
      "age": 475,
      "res": 476,
      "127": 477,
      "error": 478,
      "atoi": 479,
      "barrier_": 480,
      ",(": 481,
      "61": 482,
      "_size": 483,
      "_block": 484,
      "co": 485,
      "ccess": 486,
      "ex": 487,
      "ile": 488,
      "inde": 489,
      "stder": 490,
      "190": 491,
      "130": 492,
      "_block_size": 493,
      "index": 494,
      "stderr": 495,
      "(*)": 496,
      ")[": 497,
      "21": 498,
      "27": 499,
      "_data": 500,
      "_array": 501,
      "em": 502,
      "wh": 503,
      ")),(": 504,
      "ted": 505,
      "ckage": 506,
      "rnel": 507,
      "stdbool": 508,
      "])(": 509,
      "package": 510,
      "polybench_alloc": 511,
      "kernel": 512,
      "(*)[": 513,
      "polybench_alloc_data": 514,
      "Access": 515,
      "Iss": 516,
      "Mem": 517,
      "ory": 518,
      "sible": 519,
      "visible": 520,
      "Issue": 521,
      "Memory": 522,
      "(-(": 523,
      "?(-(": 524,
      "and": 525,
      "ault": 526,
      "cal": 527,
      "?-(-(": 528,
      "lock_t": 529,
      "omp_lock_t": 530,
      "sum0": 531,
      "33": 532,
      "ment": 533,
      "ini": 534,
      "pected": 535,
      "tialize": 536,
      "**": 537,
      "67": 538,
      "69": 539,
      "94": 540,
      "dy": 541,
      "no": 542,
      "164": 543,
      "159": 544,
      "120": 545,
      "ched": 546,
      "198": 547,
      "blocks": 548,
      "187": 549,
      "xa1": 550,
      "xa2": 551,
      ",\"": 552,
      "31": 553,
      "by": 554,
      "get": 555,
      "use": 556,
      "xx": 557,
      "yy": 558,
      "art": 559,
      "omp_get": 560,
      "thread_": 561,
      "expected": 562,
      "omp_get_": 563,
      "71": 564,
      "IZ": 565,
      "MS": 566,
      "[%": 567,
      "c6": 568,
      "done": 569,
      "fib": 570,
      "l2": 571,
      "u2": 572,
      "ush": 573,
      "ve": 574,
      "mat": 575,
      "omic": 576,
      "decl": 577,
      "))))))": 578,
      ")))))))": 579,
      "num_teams": 580,
      "atomic": 581,
      "sections": 582,
      "--------------------------------": 583,
      "polybench_timer": 584,
      "flush": 585,
      "packages": 586,
      "IZE": 587,
      "MSIZE": 588,
      "declar": 589,
      "polybench_timer_": 590,
      "(+": 591,
      "-=": 592,
      "]+=": 593,
      "ph": 594,
      "lement": 595,
      "redu": 596,
      "race": 597,
      "pair": 598,
      "ild": 599,
      "Thread": 600,
      "core": 601,
      "while": 602,
      "(+:": 603,
      "reduction": 604,
      "11": 605,
      "1st": 606,
      "23": 607,
      "2nd": 608,
      "bp": 609,
      "f1": 610,
      "fflush": 611,
      "im": 612,
      "idx": 613,
      "sched": 614,
      "dout": 615,
      "stdout": 616,
      "unction": 617,
      "498": 618,
      "35": 619,
      "37": 620,
      "39": 621,
      "59": 622,
      "cop": 623,
      "ea": 624,
      "flo": 625,
      "154": 626,
      "//#": 627,
      "197": 628,
      "default": 629,
      "float": 630,
      "14": 631,
      "521": 632,
      "No": 633,
      "St": 634,
      "Set": 635,
      "Score": 636,
      "]++;": 637,
      "fe": 638,
      "input": 639,
      "int64": 640,
      "--;": 641,
      "output": 642,
      "result": 643,
      "indexSet": 644,
      "thread_num": 645,
      "omp_get_thread_num": 646,
      "match": 647,
      "int64_t": 648,
      ")/": 649,
      "499": 650,
      "In": 651,
      "Len": 652,
      "]*": 653,
      "an": 654,
      "function": 655,
      "la": 656,
      "ty": 657,
      "))))?": 658,
      "child": 659,
      "1285": 660,
      "999": 661,
      "nest": 662,
      "type": 663,
      "..": 664,
      "42": 665,
      "51": 666,
      "512": 667,
      "Ini": 668,
      "able": 669,
      "ber": 670,
      "ef": 671,
      "hea": 672,
      "i2": 673,
      "iss": 674,
      "liv": 675,
      "scop": 676,
      "ule": 677,
      "ust": 678,
      "start": 679,
      "print_array": 680,
      "init_array": 681,
      "stru": 682,
      "new": 683,
      "cap": 684,
      "code": 685,
      "kernel_": 686,
      "call": 687,
      ",\"\\": 688,
      "declare": 689,
      "schedule": 690,
      "Include": 691,
      "nest_lock": 692,
      "header": 693,
      "live": 694,
      "83": 695,
      "LE": 696,
      "_M": 697,
      "element": 698,
      "from": 699,
      "iable": 700,
      "nam": 701,
      "uni": 702,
      "vs": 703,
      "inc": 704,
      "math": 705,
      "rand": 706,
      "2013": 707,
      "consum": 708,
      "produ": 709,
      "Initialize": 710,
      "struct": 711,
      "unistd": 712,
      "17": 713,
      "2l": 714,
      "53": 715,
      "73": 716,
      "81": 717,
      "87": 718,
      "Data": 719,
      "_nest_lock": 720,
      "comp": 721,
      "cul": 722,
      "min": 723,
      "myb": 724,
      "npro": 725,
      "r_": 726,
      "sa": 727,
      "};": 728,
      "orde": 729,
      "ag_t": 730,
      "des": 731,
      "stop": 732,
      "red": 733,
      "rect": 734,
      "old": 735,
      "numNo": 736,
      "diag": 737,
      "threadprivate": 738,
      "string": 739,
      "flag_t": 740,
      "barrier_wait": 741,
      "initialize": 742,
      "newS": 743,
      "incr_": 744,
      "2lf": 745,
      "mybarrier": 746,
      "nprod": 747,
      "ordered": 748,
      "numNodes": 749,
      "].": 750,
      "au": 751,
      "gn": 752,
      "gen": 753,
      "nce": 754,
      "pd": 755,
      "tp": 756,
      "tri": 757,
      "uta": 758,
      "uold": 759,
      "x_block_size": 760,
      "y_block_size": 761,
      "inLen": 762,
      "sign": 763,
      "rite": 764,
      "]=((": 765,
      "sum2": 766,
      "correct": 767,
      "irst": 768,
      "dynam": 769,
      "Threads": 770,
      "produce": 771,
      "computa": 772,
      "dynamic": 773,
      "computation": 774,
      "';": 775,
      ")*": 776,
      "Be": 777,
      "Done": 778,
      "Def": 779,
      "Er": 780,
      "End": 781,
      "MY": 782,
      "Pre": 783,
      "aco": 784,
      "bi": 785,
      "f0": 786,
      "file": 787,
      "jaco": 788,
      "ll": 789,
      "nsteps": 790,
      "nthread": 791,
      "os": 792,
      "sj": 793,
      "wil": 794,
      "real": 795,
      "rence": 796,
      "low": 797,
      "loop": 798,
      "argum": 799,
      "ith": 800,
      "ates": 801,
      "numThreads": 802,
      "local": 803,
      "))))?((((": 804,
      "construct": 805,
      "ness": 806,
      "20000": 807,
      "phase": 808,
      "ference": 809,
      "matchScore": 810,
      "LEN": 811,
      "aux": 812,
      "correctness": 813,
      "Error": 814,
      "MYLEN": 815,
      "jacobi": 816,
      "will": 817,
      "argument": 818,
      ").": 819,
      ".\\": 820,
      "54": 821,
      "Var": 822,
      "first": 823,
      "gth": 824,
      "miss": 825,
      "nE": 826,
      "po": 827,
      "with": 828,
      "zation": 829,
      "z_block_size": 830,
      "arit": 831,
      "][(-": 832,
      "reference": 833,
      "vars": 834,
      "length": 835,
      "onal": 836,
      "10000": 837,
      "number": 838,
      "995": 839,
      "num_vars": 840,
      "value": 841,
      "ilarit": 842,
      "max_": 843,
      "can": 844,
      "not": 845,
      "used": 846,
      "pha": 847,
      "Start": 848,
      "typedef": 849,
      "real8": 850,
      "Variable": 851,
      "ilarity": 852,
      "\"\"": 853,
      "(!": 854,
      "-%": 855,
      "2d": 856,
      "3m": 857,
      "525": 858,
      "533": 859,
      "911": 860,
      "Ar": 861,
      "All": 862,
      "CE": 863,
      "Can": 864,
      "Di": 865,
      "DCE": 866,
      "LL": 867,
      "Ma": 868,
      "Must": 869,
      "NU": 870,
      "Pr": 871,
      "Pos": 872,
      "Re": 873,
      "Ret": 874,
      "Run": 875,
      "_set": 876,
      "_count": 877,
      "bench": 878,
      "cle": 879,
      "com": 880,
      "cmp": 881,
      "ding": 882,
      "eve": 883,
      "ga": 884,
      "gr": 885,
      "ise": 886,
      "imp": 887,
      "m_": 888,
      "mo": 889,
      "mon": 890,
      "must": 891,
      "ncon": 892,
      "ole": 893,
      "pi": 894,
      "pcounter": 895,
      "rk": 896,
      "so": 897,
      "spec": 898,
      "scan": 899,
      "using": 900,
      "vent": 901,
      "inclu": 902,
      "ination": 903,
      "may": 904,
      "mark": 905,
      "blem": 906,
      "dead": 907,
      "sid": 908,
      "resid": 909,
      "alpha": 910,
      "also": 911,
      "similarity": 912,
      "--){": 913,
      "tire": 914,
      "ific": 915,
      "printed": 916,
      "entire": 917,
      "(\"\\": 918,
      "omp_set": 919,
      "rix": 920,
      "rieve": 921,
      "adi": 922,
      "/*--------------------------------": 923,
      "],\"\"": 924,
      "raise": 925,
      "endscop": 926,
      "unsign": 927,
      "elim": 928,
      "num_blocks": 929,
      "strcmp": 930,
      "2025": 931,
      "section_count": 932,
      "add_M": 933,
      "time": 934,
      "timed": 935,
      "allocation": 936,
      "problem": 937,
      "The": 938,
      "This": 939,
      "maxPos": 940,
      "tialization": 941,
      "cause": 942,
      "whole": 943,
      "initialization": 944,
      "nowait": 945,
      ",\"%": 946,
      "------------------------------------": 947,
      "declaration": 948,
      "polybench_timer_print": 949,
      "polybench_timer_start": 950,
      "polybench_timer_stop": 951,
      "Stop": 952,
      "felen": 953,
      "42000": 954,
      "safelen": 955,
      "diagonal": 956,
      "incr_b": 957,
      "numNodes2": 958,
      "computational": 959,
      "Default": 960,
      "Prevent": 961,
      "lower": 962,
      "firstprivate": 963,
      "max_num_blocks": 964,
      "3mm": 965,
      "Array": 966,
      "Main": 967,
      "NULL": 968,
      "Retrieve": 969,
      "benchmark": 970,
      "clean": 971,
      "common": 972,
      "imper": 973,
      "ncons": 974,
      "specific": 975,
      "including": 976,
      "/*--------------------------------------------------------------------": 977,
      "],\"\"))": 978,
      "unsigned": 979,
      "elimination": 980,
      "add_Mult": 981,
      "119": 982,
      "1197": 983,
      "599": 984,
      "529": 985,
      "549": 986,
      "583": 987,
      "581": 988,
      "629": 989,
      "625": 990,
      "661": 991,
      "627": 992,
      "75": 993,
      "85": 994,
      "865": 995,
      "863": 996,
      "889": 997,
      "861": 998,
      "867": 999,
      "869": 1000,
      "859": 1001,
      "887": 1002,
      "885": 1003,
      "915": 1004,
      "919": 1005,
      "913": 1006,
      "965": 1007,
      "963": 1008,
      "989": 1009,
      "921": 1010,
      "967": 1011,
      "969": 1012,
      "971": 1013,
      "937": 1014,
      "939": 1015,
      "917": 1016,
      "973": 1017,
      "::": 1018,
      "AN": 1019,
      "AX": 1020,
      "Cal": 1021,
      "Con": 1022,
      "D_M": 1023,
      "Miss": 1024,
      "Num": 1025,
      "ON": 1026,
      "Ra": 1027,
      "RAN": 1028,
      "Si": 1029,
      "Uni": 1030,
      "ail": 1031,
      "ec": 1032,
      "ft": 1033,
      "fail": 1034,
      "gg": 1035,
      "ha": 1036,
      "i1": 1037,
      "id": 1038,
      "jb": 1039,
      "kb": 1040,
      "lim": 1041,
      "psum": 1042,
      "pfile": 1043,
      "ution": 1044,
      "upd": 1045,
      "ver": 1046,
      "write": 1047,
      "1615": 1048,
      "1619": 1049,
      "1613": 1050,
      "1665": 1051,
      "1649": 1052,
      "1621": 1053,
      "1667": 1054,
      "1669": 1055,
      "1671": 1056,
      "1623": 1057,
      "1639": 1058,
      "1617": 1059,
      "1673": 1060,
      "1675": 1061,
      "1565": 1062,
      "1563": 1063,
      "1589": 1064,
      "1561": 1065,
      "1567": 1066,
      "1569": 1067,
      "1571": 1068,
      "1535": 1069,
      "1537": 1070,
      "1539": 1071,
      "1587": 1072,
      "left": 1073,
      "inter": 1074,
      "pred": 1075,
      "mast": 1076,
      "ome": 1077,
      "restri": 1078,
      "remo": 1079,
      "seg": 1080,
      "1229": 1081,
      "1249": 1082,
      "1255": 1083,
      "1225": 1084,
      "1257": 1085,
      "1227": 1086,
      "1233": 1087,
      "1231": 1088,
      "1223": 1089,
      "1259": 1090,
      "1251": 1091,
      "1253": 1092,
      "erate": 1093,
      "1281": 1094,
      "1283": 1095,
      "1929": 1096,
      "1955": 1097,
      "1925": 1098,
      "1957": 1099,
      "1961": 1100,
      "1927": 1101,
      "1933": 1102,
      "1931": 1103,
      "1935": 1104,
      "1959": 1105,
      "1951": 1106,
      "1953": 1107,
      "1329": 1108,
      "1327": 1109,
      "1333": 1110,
      "1331": 1111,
      "1311": 1112,
      "1335": 1113,
      "1337": 1114,
      "991": 1115,
      "993": 1116,
      "997": 1117,
      "buted": 1118,
      "2011": 1119,
      "651": 1120,
      "653": 1121,
      "655": 1122,
      "657": 1123,
      "659": 1124,
      "180": 1125,
      "1899": 1126,
      "1883": 1127,
      "1881": 1128,
      "contri": 1129,
      "551": 1130,
      "553": 1131,
      "555": 1132,
      "557": 1133,
      "progr": 1134,
      "based": 1135,
      "631": 1136,
      "633": 1137,
      "635": 1138,
      "2003": 1139,
      "2005": 1140,
      "2007": 1141,
      "2009": 1142,
      "573": 1143,
      "575": 1144,
      "577": 1145,
      "579": 1146,
      "891": 1147,
      "893": 1148,
      "895": 1149,
      "601": 1150,
      "603": 1151,
      "605": 1152,
      "607": 1153,
      "609": 1154,
      "1275": 1155,
      "1277": 1156,
      "1279": 1157,
      "1901": 1158,
      "1903": 1159,
      "1905": 1160,
      "1907": 1161,
      "1909": 1162,
      "1301": 1163,
      "1303": 1164,
      "1305": 1165,
      "1307": 1166,
      "1309": 1167,
      "calc": 1168,
      "calcul": 1169,
      "initial": 1170,
      "941": 1171,
      "943": 1172,
      "945": 1173,
      "947": 1174,
      "1641": 1175,
      "1643": 1176,
      "1645": 1177,
      "1647": 1178,
      "1591": 1179,
      "1593": 1180,
      "1595": 1181,
      "1597": 1182,
      "1201": 1183,
      "1203": 1184,
      "1205": 1185,
      "1207": 1186,
      "1981": 1187,
      "1983": 1188,
      "1985": 1189,
      "1987": 1190,
      "1873": 1191,
      "1875": 1192,
      "1877": 1193,
      "1879": 1194,
      "thread_lim": 1195,
      "races": 1196,
      "1541": 1197,
      "1543": 1198,
      "1545": 1199,
      "1977": 1200,
      "1979": 1201,
      "lap": 1202,
      "consumed": 1203,
      "newSxx": 1204,
      "newSyy": 1205,
      "generate": 1206,
      "produced": 1207,
      "547": 1208,
      "Diag": 1209,
      "Pro": 1210,
      "1199": 1211,
      "Calcul": 1212,
      "D_MAX": 1213,
      "Number": 1214,
      "Race": 1215,
      "RAND_MAX": 1216,
      "Univ": 1217,
      "update": 1218,
      "master": 1219,
      "restrict": 1220,
      "contributed": 1221,
      "program": 1222,
      "calculation": 1223,
      "thread_limit": 1224,
      "(%": 1225,
      ")]": 1226,
      "149": 1227,
      "24": 1228,
      "527": 1229,
      "531": 1230,
      "523": 1231,
      "<<": 1232,
      "Ab": 1233,
      "Bool": 1234,
      "Ch": 1235,
      "GA": 1236,
      "Get": 1237,
      "Mult": 1238,
      "TT": 1239,
      "Ta": 1240,
      "Write": 1241,
      "]@": 1242,
      "_w": 1243,
      "_task": 1244,
      "_2d": 1245,
      "_imper": 1246,
      "_Bool": 1247,
      "ai": 1248,
      "aj": 1249,
      "cer": 1250,
      "col": 1251,
      "ev": 1252,
      "ice": 1253,
      "j2": 1254,
      "k2": 1255,
      "nt": 1256,
      "py": 1257,
      "qq": 1258,
      "rd": 1259,
      "sz": 1260,
      "tou": 1261,
      "ting": 1262,
      "up": 1263,
      "war": 1264,
      "x1": 1265,
      "x10": 1266,
      "xpy": 1267,
      "{}": 1268,
      "-((-": 1269,
      "ori": 1270,
      "orting": 1271,
      "pre": 1272,
      "++,": 1273,
      "?(((": 1274,
      "cla": 1275,
      "variable": 1276,
      "().": 1277,
      "()==": 1278,
      "(((((((((": 1279,
      "))?(((((((": 1280,
      "thrd": 1281,
      "dire": 1282,
      "992": 1283,
      "outLen": 1284,
      "num_sz": 1285,
      "1048": 1286,
      "uling": 1287,
      "val_w": 1288,
      "const": 1289,
      "allocate": 1290,
      "]!=-": 1291,
      "tmp1": 1292,
      "barrier_init": 1293,
      "barrier_destroy": 1294,
      "barrier_start": 1295,
      "barrier_stop": 1296,
      "coef": 1297,
      "exec": 1298,
      "ments": 1299,
      "matrix": 1300,
      "scheduling": 1301,
      "matchMiss": 1302,
      "...\\": 1303,
      "kernel_jacobi": 1304,
      "kernel_adi": 1305,
      "kernel_3mm": 1306,
      "elements": 1307,
      "consume": 1308,
      "saxpy": 1309,
      "incr_a": 1310,
      "gen_task": 1311,
      "trigg": 1312,
      "missing": 1313,
      "nEle": 1314,
      "values": 1315,
      "Consum": 1316,
      "idth": 1317,
      "interval_w": 1318,
      "remove": 1319,
      "segments": 1320,
      "lapse": 1321,
      "Produ": 1322,
      "1492": 1323,
      "Aborting": 1324,
      "Child": 1325,
      "Task": 1326,
      "Write_set": 1327,
      "_2d_imper": 1328,
      "collapse": 1329,
      "even": 1330,
      "touched": 1331,
      "x1024": 1332,
      "execution": 1333,
      "matchMissmatchScore": 1334,
      "kernel_jacobi_2d_imper": 1335,
      "trigger": 1336,
      "interval_width": 1337,
      ")][": 1338,
      "2000": 1339,
      "40": 1340,
      "70": 1341,
      "Alloc": 1342,
      "Ex": 1343,
      "Element": 1344,
      "Fib": 1345,
      "Function": 1346,
      "Gu": 1347,
      "Gen": 1348,
      "NON": 1349,
      "PI": 1350,
      "Pu": 1351,
      "Rice": 1352,
      "Yi": 1353,
      "]-=": 1354,
      "_c": 1355,
      "_sum": 1356,
      "ac": 1357,
      "ax": 1358,
      "ay": 1359,
      "boun": 1360,
      "cil": 1361,
      "due": 1362,
      "es": 1363,
      "fine": 1364,
      "gin": 1365,
      "ip": 1366,
      "j1": 1367,
      "k1": 1368,
      "ld": 1369,
      "my": 1370,
      "nv": 1371,
      "nDiag": 1372,
      "pScore": 1373,
      "q_c": 1374,
      "r1": 1375,
      "rpo": 1376,
      "tx": 1377,
      "tter": 1378,
      "tol": 1379,
      "ures": 1380,
      "vel": 1381,
      "v_sum": 1382,
      "we": 1383,
      "wo": 1384,
      "wor": 1385,
      "zi": 1386,
      "insert": 1387,
      "letter": 1388,
      "level": 1389,
      "ould": 1390,
      "dela": 1391,
      "sten": 1392,
      "sition": 1393,
      "ret": 1394,
      "refine": 1395,
      "aling": 1396,
      "seq_c": 1397,
      "parent": 1398,
      "teration": 1399,
      "skip": 1400,
      "set_nest_lock": 1401,
      "ines": 1402,
      "should": 1403,
      "dition": 1404,
      "omp_unset_nest_lock": 1405,
      "tempfile": 1406,
      "256": 1407,
      "omp_get_num_threads": 1408,
      "pairs": 1409,
      "copy": 1410,
      "pdv_sum": 1411,
      "signaling": 1412,
      "nElement": 1413,
      "position": 1414,
      "gapScore": 1415,
      "m_nv": 1416,
      "m_pdv_sum": 1417,
      "similarityScore": 1418,
      "omp_set_": 1419,
      "omp_set_nest_lock": 1420,
      "failures": 1421,
      "omega": 1422,
      "Calculate": 1423,
      "origin": 1424,
      "prede": 1425,
      "clause": 1426,
      "Allocates": 1427,
      "NONE": 1428,
      "Purpo": 1429,
      "Yizi": 1430,
      "bound": 1431,
      "cil_": 1432,
      "mytempfile": 1433,
      "txt": 1434,
      "work": 1435,
      "delay": 1436,
      "stencil_": 1437,
      "seq_cst": 1438,
      "m_nvol": 1439,
      "original": 1440,
      "Purpose": 1441,
      "',": 1442,
      "'←": 1443,
      "'↑": 1444,
      "):": 1445,
      ")=%": 1446,
      ")++;": 1447,
      ")][-": 1448,
      "*));": 1449,
      "**)": 1450,
      "0f": 1451,
      "054": 1452,
      "4000": 1453,
      "56": 1454,
      "62": 1455,
      "66": 1456,
      "923": 1457,
      ":%": 1458,
      ">-": 1459,
      "?-((-": 1460,
      "AG": 1461,
      "AL": 1462,
      "ATT": 1463,
      "BU": 1464,
      "CA": 1465,
      "CTT": 1466,
      "DE": 1467,
      "DI": 1468,
      "De": 1469,
      "Del": 1470,
      "FT": 1471,
      "First": 1472,
      "HS": 1473,
      "Hel": 1474,
      "M_": 1475,
      "Mat": 1476,
      "RHS": 1477,
      "Ste": 1478,
      "Sum": 1479,
      "TH": 1480,
      "Two": 1481,
      "UP": 1482,
      "Wu": 1483,
      "Wen": 1484,
      "]<=": 1485,
      "]};": 1486,
      "_input": 1487,
      "_from": 1488,
      "af": 1489,
      "ack": 1490,
      "ach": 1491,
      "ang": 1492,
      "access": 1493,
      "awar": 1494,
      "bu": 1495,
      "bal": 1496,
      "bet": 1497,
      "back": 1498,
      "ci": 1499,
      "cti": 1500,
      "calloc": 1501,
      "cted": 1502,
      "dri": 1503,
      "eg": 1504,
      "est": 1505,
      "fop": 1506,
      "gea": 1507,
      "ire": 1508,
      "iteration": 1509,
      "li": 1510,
      "ly": 1511,
      "line": 1512,
      "men": 1513,
      "mit": 1514,
      "mer": 1515,
      "mute": 1516,
      "ning": 1517,
      "ops": 1518,
      "over": 1519,
      "per": 1520,
      "qu": 1521,
      "sy": 1522,
      "sin": 1523,
      "sam": 1524,
      "score": 1525,
      "srand": 1526,
      "some": 1527,
      "tra": 1528,
      "x1000": 1529,
      "xinout": 1530,
      "zer": 1531,
      "{&": 1532,
      "{};": 1533,
      "orage": 1534,
      "++]": 1535,
      "?(((((": 1536,
      "?((((((": 1537,
      "deallocate": 1538,
      "stprivate": 1539,
      "storage": 1540,
      "tected": 1541,
      "reas": 1542,
      "rela": 1543,
      "allow": 1544,
      "0000": 1545,
      "load": 1546,
      "lobal": 1547,
      "loops": 1548,
      "setu": 1549,
      "seed": 1550,
      "sent": 1551,
      "((((((((": 1552,
      "chang": 1553,
      "omp_nest_lock": 1554,
      "]==": 1555,
      "erates": 1556,
      "1001": 1557,
      "ad_set": 1558,
      "taskloop": 1559,
      "===": 1560,
      "ced": 1561,
      "dimen": 1562,
      "num_steps": 1563,
      "num_refine": 1564,
      "there": 1565,
      "10x1024": 1566,
      "dataset": 1567,
      "))))?(((": 1568,
      "checking": 1569,
      "2048": 1570,
      "20x1000": 1571,
      "oper": 1572,
      "pass": 1573,
      "497": 1574,
      "condition": 1575,
      "stant": 1576,
      "omp_init_nest_lock": 1577,
      "omp_destroy_nest_lock": 1578,
      "maxim": 1579,
      "cessor": 1580,
      "exit": 1581,
      "now": 1582,
      "phen": 1583,
      "Note": 1584,
      "lastprivate": 1585,
      "...": 1586,
      "LEFT": 1587,
      "consumer": 1588,
      "producer": 1589,
      "Because": 1590,
      "Defines": 1591,
      "Present": 1592,
      "lld": 1593,
      "missmatchScore": 1594,
      "within": 1595,
      "Real": 1596,
      "Read_set": 1597,
      "ONAL": 1598,
      "Size": 1599,
      "Sieg": 1600,
      "fails": 1601,
      "hao": 1602,
      "have": 1603,
      "calcFirst": 1604,
      "DiagElement": 1605,
      "Calculates": 1606,
      "GAATT": 1607,
      "GACTT": 1608,
      "warning": 1609,
      "variables": 1610,
      "direction": 1611,
      "directi": 1612,
      "coeff": 1613,
      "Consumer": 1614,
      "Consumed": 1615,
      "Producer": 1616,
      "Produced": 1617,
      "Expected": 1618,
      "Generates": 1619,
      "acqu": 1620,
      "copyin": 1621,
      "predecessor": 1622,
      "stencil_calc": 1623,
      "'←'": 1624,
      "'↑'": 1625,
      "0543": 1626,
      "AGONAL": 1627,
      "BUG": 1628,
      "DEBUG": 1629,
      "DIAGONAL": 1630,
      "Delawar": 1631,
      "Helper": 1632,
      "M_PI": 1633,
      "Matrix": 1634,
      "Stephen": 1635,
      "Wenhao": 1636,
      "_from_input": 1637,
      "after": 1638,
      "backtra": 1639,
      "driver": 1640,
      "fopen": 1641,
      "geable": 1642,
      "linear": 1643,
      "mits": 1644,
      "mergeable": 1645,
      "mutexinout": 1646,
      "sink": 1647,
      "same": 1648,
      "zeros": 1649,
      "reasing": 1650,
      "relax": 1651,
      "load_from_input": 1652,
      "setup": 1653,
      "change": 1654,
      "omp_nest_lock_t": 1655,
      "dimensi": 1656,
      "10x1024x1024": 1657,
      "stants": 1658,
      "maximum": 1659,
      "Siegel": 1660,
      "calcFirstDiagElement": 1661,
      "GAATTCA": 1662,
      "directive": 1663,
      "acquire": 1664,
      "Delaware": 1665,
      "Helpers": 1666,
      "backtrack": 1667,
      "mutexinoutset": 1668,
      "\"%": 1669,
      "\"<<": 1670,
      "())": 1671,
      ")-": 1672,
      ")\\": 1673,
      "+\");": 1674,
      "/(": 1675,
      "/((": 1676,
      "05": 1677,
      "26": 1678,
      "28": 1679,
      "30": 1680,
      "34": 1681,
      "96": 1682,
      "97": 1683,
      ";}": 1684,
      "Al": 1685,
      "An": 1686,
      "ATH": 1687,
      "Aach": 1688,
      "CP": 1689,
      "Cl": 1690,
      "Cen": 1691,
      "Col": 1692,
      "Cop": 1693,
      "FI": 1694,
      "Global": 1695,
      "Iteration": 1696,
      "Jo": 1697,
      "Lo": 1698,
      "Lines": 1699,
      "PATH": 1700,
      "RW": 1701,
      "Rand": 1702,
      "Str": 1703,
      "Sim": 1704,
      "To": 1705,
      "Tim": 1706,
      "Test": 1707,
      "Upd": 1708,
      "We": 1709,
      "With": 1710,
      "[*": 1711,
      "[]": 1712,
      "]\\": 1713,
      "_s": 1714,
      "_device": 1715,
      "_pro": 1716,
      "_initial": 1717,
      "_li": 1718,
      "ab": 1719,
      "ass": 1720,
      "bl": 1721,
      "bs": 1722,
      "bta": 1723,
      "ctu": 1724,
      "cout": 1725,
      "cassert": 1726,
      "carri": 1727,
      "creasing": 1728,
      "esh": 1729,
      "fcl": 1730,
      "fault": 1731,
      "gma": 1732,
      "gni": 1733,
      "gone": 1734,
      "global": 1735,
      "ho": 1736,
      "has": 1737,
      "ich": 1738,
      "ient": 1739,
      "ista": 1740,
      "mine": 1741,
      "mul": 1742,
      "mem": 1743,
      "mesh": 1744,
      "mista": 1745,
      "nc": 1746,
      "ns": 1747,
      "none": 1748,
      "nMatrix": 1749,
      "ose": 1750,
      "ove": 1751,
      "oci": 1752,
      "obta": 1753,
      "pp": 1754,
      "ple": 1755,
      "ping": 1756,
      "pat": 1757,
      "qr": 1758,
      "que": 1759,
      "ron": 1760,
      "rce": 1761,
      "sb": 1762,
      "sf": 1763,
      "sm": 1764,
      "sw": 1765,
      "sou": 1766,
      "sol": 1767,
      "sqr": 1768,
      "tw": 1769,
      "tal": 1770,
      "tze": 1771,
      "two": 1772,
      "user": 1773,
      "ved": 1774,
      "ving": 1775,
      "wtime": 1776,
      "wron": 1777,
      "inste": 1778,
      "1500": 1779,
      "orted": 1780,
      "ores": 1781,
      "lete": 1782,
      "into": 1783,
      "proper": 1784,
      "matic": 1785,
      "make": 1786,
      "oup": 1787,
      "][%": 1788,
      "deri": 1789,
      "dence": 1790,
      "decreasing": 1791,
      "delete": 1792,
      "stre": 1793,
      "sted": 1794,
      "tern": 1795,
      "tection": 1796,
      "sic": 1797,
      "sidu": 1798,
      "reco": 1799,
      "reque": 1800,
      "alread": 1801,
      "00L": 1802,
      "00000": 1803,
      "simul": 1804,
      "tiple": 1805,
      "ify": 1806,
      "ifdef": 1807,
      "stdint": 1808,
      "returns": 1809,
      "()%": 1810,
      "()\\": 1811,
      "umns": 1812,
      "ens": 1813,
      "ensu": 1814,
      "endence": 1815,
      "onac": 1816,
      "\",\"": 1817,
      "termin": 1818,
      "termine": 1819,
      "iostre": 1820,
      "omp_is": 1821,
      "zed": 1822,
      "])/": 1823,
      "this": 1824,
      "addition": 1825,
      "taskgr": 1826,
      "location": 1827,
      "endl": 1828,
      "endif": 1829,
      "ings": 1830,
      "dir": 1831,
      "unable": 1832,
      "uted": 1833,
      "dependence": 1834,
      "assic": 1835,
      "serve": 1836,
      "serts": 1837,
      "2015": 1838,
      "2040": 1839,
      "arrays": 1840,
      "_tol": 1841,
      "tral": 1842,
      "add_s": 1843,
      "pace": 1844,
      "valid": 1845,
      "sugg": 1846,
      "tomatic": 1847,
      "constants": 1848,
      "oops": 1849,
      "stable": 1850,
      "stack": 1851,
      "icient": 1852,
      "protected": 1853,
      "protection": 1854,
      "2560": 1855,
      "publ": 1856,
      "ones": 1857,
      "because": 1858,
      "ctori": 1859,
      "causing": 1860,
      "error_tol": 1861,
      "indexing": 1862,
      "which": 1863,
      "**));": 1864,
      "***)": 1865,
      "****": 1866,
      "***));": 1867,
      "****)": 1868,
      "node": 1869,
      "omp_get_max_": 1870,
      "omp_get_wtime": 1871,
      "vectori": 1872,
      "each": 1873,
      "Stores": 1874,
      "results": 1875,
      "Inserts": 1876,
      "]*(": 1877,
      "]*=": 1878,
      "answ": 1879,
      "labs": 1880,
      "nested": 1881,
      "517": 1882,
      "51200L": 1883,
      "Initial": 1884,
      "structu": 1885,
      "new_pro": 1886,
      "832040": 1887,
      "name": 1888,
      "names": 1889,
      "increasing": 1890,
      "compared": 1891,
      "rectly": 1892,
      "strings": 1893,
      "automatic": 1894,
      "ferences": 1895,
      "missmatch": 1896,
      "pointer": 1897,
      "phabet": 1898,
      "Variables": 1899,
      "Directly": 1900,
      "Proper": 1901,
      "Residu": 1902,
      "References": 1903,
      "move": 1904,
      "alphabet": 1905,
      "Constants": 1906,
      "Missing": 1907,
      "Sigma": 1908,
      "ecuted": 1909,
      "happ": 1910,
      "verify": 1911,
      "removing": 1912,
      "calcElement": 1913,
      "initialTim": 1914,
      "lapping": 1915,
      "Protze": 1916,
      "<<\"": 1917,
      "Gets": 1918,
      "preserve": 1919,
      "class": 1920,
      "matrixes": 1921,
      "4096": 1922,
      "Executed": 1923,
      "Fibonac": 1924,
      "copyprivate": 1925,
      "omp_set_num_threads": 1926,
      "omp_set_dynamic": 1927,
      "omp_set_nested": 1928,
      "predetermin": 1929,
      "stencil_in": 1930,
      "Detected": 1931,
      "Determine": 1932,
      "achim": 1933,
      "but": 1934,
      "busy": 1935,
      "ested": 1936,
      "like": 1937,
      "overlapping": 1938,
      "sync": 1939,
      "scores": 1940,
      "allows": 1941,
      "000000000": 1942,
      "coefficient": 1943,
      "dimension": 1944,
      "dimensional": 1945,
      "())/((": 1946,
      "Alphabet": 1947,
      "Any": 1948,
      "Aachen": 1949,
      "CPU": 1950,
      "Classic": 1951,
      "Central": 1952,
      "Columns": 1953,
      "Copy": 1954,
      "FILE": 1955,
      "Iterations": 1956,
      "Joachim": 1957,
      "Loop": 1958,
      "RWTH": 1959,
      "Random": 1960,
      "Strings": 1961,
      "Similarity": 1962,
      "Total": 1963,
      "Updates": 1964,
      "Without": 1965,
      "_initial_device": 1966,
      "_list": 1967,
      "above": 1968,
      "associ": 1969,
      "carried": 1970,
      "fclose": 1971,
      "gnized": 1972,
      "host": 1973,
      "multiple": 1974,
      "memset": 1975,
      "mistake": 1976,
      "obtain": 1977,
      "pattern": 1978,
      "source": 1979,
      "solution": 1980,
      "sqrt": 1981,
      "twice": 1982,
      "wrong": 1983,
      "instead": 1984,
      "orted_list": 1985,
      "properly": 1986,
      "makes": 1987,
      "derived": 1988,
      "recognized": 1989,
      "requested": 1990,
      "already": 1991,
      "simulate": 1992,
      "ensure": 1993,
      "iostream": 1994,
      "omp_is_initial_device": 1995,
      "taskgroup": 1996,
      "add_sorted_list": 1997,
      "suggested": 1998,
      "public": 1999,
      "omp_get_max_threads": 2000,
      "vectorization": 2001,
      "answer": 2002,
      "structure": 2003,
      "new_proc": 2004,
      "namespace": 2005,
      "pointers": 2006,
      "Residual": 2007,
      "happens": 2008,
      "initialTime": 2009,
      "Fibonacci": 2010,
      "predetermined": 2011,
      "0000000001": 2012,
      "coefficients": 2013,
      "associate": 2014
    },
    "merges": [
      "1 6",
      "( (",
      ") )",
      "i n",
      "c 2",
      "n j",
      "c 4",
      "- (",
      "n k",
      "1 5",
      "c 3",
      "- ((",
      "-(( -(",
      "o r",
      "l e",
      "c 1",
      "n l",
      "n m",
      "f or",
      "in t",
      "p r",
      "m a",
      "o m",
      "+ +",
      "om p",
      "? ((",
      "++ )",
      "o u",
      "a r",
      "a g",
      "pr ag",
      "prag ma",
      "] [",
      "< =",
      "n i",
      ")) )",
      "b le",
      "d ou",
      ") ;",
      "dou ble",
      "d e",
      ")) ;",
      "? -((-(",
      "(( (",
      "s t",
      "t e",
      "s i",
      "r e",
      "a l",
      "0 0",
      "c l",
      "cl u",
      "l o",
      "clu de",
      "in clude",
      "si m",
      "sim d",
      "c k",
      "- -",
      "s e",
      "t i",
      "i f",
      "r n",
      "1 2",
      "t u",
      ")) ))",
      "st d",
      "re tu",
      "retu rn",
      "v ar",
      "( -",
      "? -(",
      "lo ck",
      "ar g",
      "? (-",
      "?-( -",
      "ou n",
      "( )",
      "c oun",
      "p ar",
      "pr int",
      "le l",
      "al lel",
      "par allel",
      "(( ((",
      "le n",
      "u m",
      "c h",
      "e n",
      "print f",
      "o n",
      "ma in",
      "( \"",
      "] ;",
      "t a",
      "\" ,",
      "te r",
      "i o",
      "std io",
      "coun ter",
      "omp _",
      ")) ?((",
      "r i",
      "-- --",
      "i t",
      "] =",
      "() {",
      "e r",
      "( &",
      "/ /",
      "1 00",
      "o f",
      "z e",
      "++) {",
      "counter var",
      "12 8",
      "_ lock",
      "] )",
      "))?(( (",
      "t h",
      "s k",
      "a d",
      "si ze",
      "ta sk",
      "( );",
      "5 00",
      "> =",
      "c 0",
      "= =",
      "a te",
      "o l",
      "s um",
      "* /",
      "/ *",
      "ti on",
      "1 9",
      "c e",
      "o i",
      "& &",
      "e t",
      "i v",
      "de f",
      "e d",
      ")) )))",
      "se t",
      "pr iv",
      "priv ate",
      "in it",
      "in e",
      "n um",
      "v oi",
      "voi d",
      "i b",
      "arg c",
      "arg v",
      "] ,",
      "a m",
      "def ine",
      "lo c",
      "] );",
      "---- ----",
      "(( (((",
      "c 8",
      "r a",
      "set _lock",
      "ti d",
      "en d",
      "b lock",
      "= %",
      "p s",
      "re ad",
      "st e",
      "v i",
      "ste ps",
      "c tion",
      "m p",
      "s h",
      "in g",
      "1 3",
      "d i",
      "u e",
      ")) ));",
      "c 5",
      "t arg",
      "te am",
      "targ et",
      "team s",
      "l ib",
      "u n",
      "ma p",
      "std lib",
      "ti c",
      "++ ;",
      "e l",
      "y b",
      "9 9",
      "t steps",
      "ou t",
      "coun t",
      "ch ar",
      "s s",
      "te st",
      "en ch",
      "r om",
      "u te",
      "* )",
      "de p",
      "size of",
      "dep end",
      "a ta",
      "b ute",
      "p ol",
      "st ri",
      "th read",
      "num _",
      "yb ench",
      "pol ybench",
      "a s",
      "c 15",
      "se r",
      "f re",
      "th e",
      "ser t",
      "fre e",
      "1 0",
      "a t",
      "u l",
      "ar ed",
      "de vi",
      "st r",
      "devi ce",
      "[ ])",
      "sh ared",
      "di stri",
      "distri bute",
      "\" );",
      "a it",
      "t of",
      "w ait",
      "tof rom",
      "as sert",
      "+ =",
      "ra y",
      "n d",
      "))))) ;",
      "d ata",
      ")))) ?((",
      "e ck",
      "ar ri",
      "ch eck",
      "2 0",
      "l loc",
      "]= %",
      "arri er",
      "ar ray",
      "c 9",
      "o ol",
      "ma lloc",
      "3 2",
      "omp_ un",
      "2 9",
      "_ t",
      "t r",
      "se ction",
      "6 5",
      "b ool",
      "f al",
      "n g",
      "omp_ set_lock",
      "omp_un set_lock",
      "tr ue",
      "fal se",
      "ad d",
      "ul t",
      "c ri",
      "o p",
      "lo ng",
      "tic al",
      "cri tical",
      ") {",
      "b arrier",
      "p a",
      "v al",
      "100 0",
      "(\" %",
      "task wait",
      "! =",
      "a se",
      "c 7",
      "c1 0",
      "00 0",
      "ti m",
      "-------- --------",
      "polybench _",
      "5 0",
      "s ing",
      "1 8",
      "i l",
      "p e",
      "x a",
      "s u",
      "t o",
      "en t",
      "4 8",
      "te mp",
      "))?(( (((",
      "4 9",
      "c on",
      "o o",
      "de r",
      "st a",
      "el se",
      "add lock",
      "su block",
      "5 5",
      "f oo",
      "al loc",
      "[ -",
      "] !=",
      "i c",
      "i s",
      "pr o",
      "sing le",
      "a tion",
      "b ase",
      "l ck",
      "o y",
      "r or",
      "t mp",
      "de str",
      "destr oy",
      "6 4",
      "d u",
      "n e",
      "ti al",
      "- >",
      "6 3",
      "l 0",
      "l 1",
      "sta tic",
      "( *",
      "2 5",
      "(((( (((",
      "2 00",
      "5 7",
      "8 9",
      "(((( ((",
      "omp_ init",
      "omp_ destroy",
      "100 000",
      "tim er",
      "T h",
      "p u",
      "?(( ((",
      "))) ;",
      "on e",
      "thread s",
      "b e",
      "f l",
      "][ -",
      "sum 1",
      "omp_init _lock",
      "omp_destroy _lock",
      "pu t",
      "] +",
      "c t",
      "d x",
      "k e",
      "in out",
      "ma x",
      "ce ss",
      "num_ threads",
      "pe c",
      "tial i",
      "6 0",
      "c a",
      "c or",
      "f printf",
      "i r",
      "u 1",
      "ag e",
      "re s",
      "12 7",
      "er ror",
      "at oi",
      "barrier _",
      ", (",
      "6 1",
      "_ size",
      "_ block",
      "c o",
      "c cess",
      "e x",
      "i le",
      "in de",
      "st der",
      "19 0",
      "13 0",
      "_block _size",
      "inde x",
      "stder r",
      "( *)",
      ") [",
      "2 1",
      "2 7",
      "_ data",
      "_ array",
      "e m",
      "w h",
      ")) ,(",
      "te d",
      "ck age",
      "rn el",
      "std bool",
      "]) (",
      "pa ckage",
      "polybench_ alloc",
      "ke rnel",
      "(*) [",
      "polybench_alloc _data",
      "A ccess",
      "I ss",
      "M em",
      "or y",
      "si ble",
      "vi sible",
      "Iss ue",
      "Mem ory",
      "( -(",
      "? (-(",
      "a nd",
      "a ult",
      "c al",
      "?-( -(",
      "lock _t",
      "omp_ lock_t",
      "sum 0",
      "3 3",
      "m ent",
      "in i",
      "pec ted",
      "tiali ze",
      "* *",
      "6 7",
      "6 9",
      "9 4",
      "d y",
      "n o",
      "16 4",
      "15 9",
      "12 0",
      "ch ed",
      "19 8",
      "block s",
      "18 7",
      "xa 1",
      "xa 2",
      ", \"",
      "3 1",
      "b y",
      "g et",
      "u se",
      "x x",
      "y y",
      "ar t",
      "omp_ get",
      "thread _",
      "ex pected",
      "omp_get _",
      "7 1",
      "I Z",
      "M S",
      "[ %",
      "c 6",
      "d one",
      "f ib",
      "l 2",
      "u 2",
      "u sh",
      "v e",
      "ma t",
      "om ic",
      "de cl",
      ")))) ))",
      ")))) )))",
      "num_ teams",
      "at omic",
      "section s",
      "---------------- ----------------",
      "polybench_ timer",
      "fl ush",
      "package s",
      "IZ E",
      "MS IZE",
      "decl ar",
      "polybench_timer _",
      "( +",
      "- =",
      "] +=",
      "p h",
      "le ment",
      "re du",
      "ra ce",
      "pa ir",
      "il d",
      "Th read",
      "cor e",
      "wh ile",
      "(+ :",
      "redu ction",
      "1 1",
      "1 st",
      "2 3",
      "2 nd",
      "b p",
      "f 1",
      "f flush",
      "i m",
      "i dx",
      "s ched",
      "dou t",
      "st dout",
      "un ction",
      "49 8",
      "3 5",
      "3 7",
      "3 9",
      "5 9",
      "c op",
      "e a",
      "f lo",
      "15 4",
      "// #",
      "19 7",
      "def ault",
      "flo at",
      "1 4",
      "5 21",
      "N o",
      "S t",
      "S et",
      "S core",
      "] ++;",
      "f e",
      "in put",
      "int 64",
      "-- ;",
      "out put",
      "res ult",
      "index Set",
      "thread_ num",
      "omp_get_ thread_num",
      "mat ch",
      "int64 _t",
      ") /",
      "4 99",
      "I n",
      "L en",
      "] *",
      "a n",
